[
    {
        "id": "BIOINFO 201",
        "title": "Seminar: Advanced Methods in Computational Biology",
        "units": 2,
        "description": "Seminar, one hour; discussion, one hour. Designed for advanced graduate students. Examination of computational methodology in bioinformatics and computational biology through presentation of current research literature. How to select and apply methods from computational and mathematical disciplines to problems in bioinformatics and computational biology; development of novel methodologies. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "BIOINFO 202",
        "title": "Bioinformatics Interdisciplinary Research Seminar",
        "units": 4,
        "description": "Seminar, two hours; discussion, two hours. Concrete examples of how biological questions about genomics data map to and are solved by methodologies from other disciplines, including statistics, computer science, and mathematics. May be repeated for credit. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "BIOINFO 229",
        "title": "Current Topics in Bioinformatics",
        "units": 4,
        "description": "Lecture, four hours. Introduction of active research topics in bioinformatics. Topics vary by instructor research area and include statistical genomics, epigenomics, single-cell analysis, metagenomics, and diagnostic informatics. Overview of research area and associated biological and technological background. Discussion of representative problems and presentation of their computational modeling and solutions. Students gain overview of current topics in bioinformatics and learn how to model and solve biological problems with computational methods. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "BIOINFO 275A",
        "title": "Applied Bioinformatics Lab for Biologists: Fundamentals",
        "units": 2,
        "description": "Laboratory, six hours (five weeks). Introduction to contemporary methods and techniques in bioinformatics that are used to analyze high-throughput genomic data. Topics include introduction to UNIX, Next Generation Sequence (NGS) data analysis, ChIP-seq, BS-seq and RNA-seq, and others. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "BIOINFO 275B",
        "title": "Applied Bioinformatics Lab for Biologists: Intermediate",
        "units": 2,
        "description": "Laboratory, six hours (five weeks). Requisite: course 275A. Contemporary methods and techniques in bioinformatics that are used to analyze high-throughput genomic data. Topics include Galaxy server, R, MATLAB, Python, and variant calling. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "BIOINFO 275A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "BIOINFO 296",
        "title": "Seminar: Research Topics in Bioinformatics",
        "units": 2,
        "description": "Seminar, to be arranged; discussion, three hours. Advanced study and analysis of current research topics in bioinformatics. Discussion of current research and literature in research specialty of faculty member teaching course. May be repeated for credit. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "BIOINFO 596",
        "title": "Directed Individual Study or Research in Bioinformatics",
        "units": 2,
        "description": "Tutorial, to be arranged. May be repeated for credit. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "BIOINFO 597",
        "title": "Preparation for MS Comprehensive Examination or PhD Qualifying Examinations",
        "units": 2,
        "description": "Tutorial, to be arranged. May be repeated for credit. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "BIOINFO 598",
        "title": "MS Thesis Research and Writing",
        "units": 2,
        "description": "Tutorial, to be arranged. May be repeated for credit. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "BIOINFO 599",
        "title": "PhD Dissertation Research and Writing",
        "units": 2,
        "description": "Tutorial, to be arranged. May be repeated for credit. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "BIOINFO M223",
        "title": "Statistical Methods in Computational Biology",
        "units": 4,
        "description": "(Same as Biomathematics M271 and Statistics M254.) Lecture, three hours; discussion, one hour. Preparation: elementary probability concepts. Requisite: course M221 or Statistics 100A or 200A. Introduction to statistical methods developed and widely applied in several branches of computational biology, such as gene expression, sequence alignment, motif discovery, comparative genomics, and biological networks, with emphasis on understanding of basic statistical concepts and use of statistical inference to solve biological problems. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "STATS 100A"},{"type": "requisite","course": "STATS 200A"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "BIOINFO M291",
        "title": "Systems Biology: Practical Data Analysis",
        "units": 4,
        "description": "(Same as Chemistry M291.) Lecture, three hours. Practical training in the analysis of large-scale biological datasets using Python. Students work with real-world data from single-cell RNA-seq, spatial transcriptomics, phospho-proteomics, and high-content imaging studies. Emphasis on hands-on coding, statistical and machine learning modeling, and clear data interpretation and visualization. A key component is the responsible use of artificial intelligence coding assistants. Students learn how to use tools like ChatGPT and Copilot to scaffold code, debug, and accelerate their analysis, while ensuring transparency and reproducibility. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    }
]
