[
    {
        "id": "C&EE 1",
        "title": "Civil Engineering and Infrastructure",
        "units": 2,
        "description": "Lecture, two hours; outside study, four hours. Examples of infrastructure, its importance, and manner by which it is designed and constructed. Role of civil engineers in infrastructure development and preservation. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 103",
        "title": "Applied Numerical Computing and Modeling in Civil and Environmental Engineering",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: course M20 (or Computer Science 31), Mathematics 33B or Mechanical and Aerospace Engineering 82 (either may be taken concurrently). Introduction to numerical computing with specific applications in civil and environmental engineering. Topics include error and computer arithmetic, root finding, curve fitting, numerical integration and differentiation, solution of systems of linear and nonlinear equations, numerical solution of ordinary and partial differential equations. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE M20"},{"type": "requisite","course": "COM SCI 31"}]},
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "MATH 33B"},{"type": "requisite","course": "MECH&AE 82"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 107",
        "title": "Environmental Fluid Mechanics",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: Mathematics 32B, 33A. Recommended: Some knowledge of MATLAB or Python. Introduction in environmental fluid mechanics with focus on water. Students gain fundamental understanding of principles governing behavior of water in environmental contexts. Through comprehensive exploration of theoretical concepts, practical applications, and virtual laboratories, students develop profound understanding of principles governing water behavior in natural and engineered environments. May be repeated once for credit. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "MATH 32B"},
            {"type": "requisite","course": "MATH 33A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 108",
        "title": "Introduction to Mechanics of Deformable Solids",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: course 91 or Mechanical and Aerospace Engineering 101, Mathematics 32B, Physics 1A. Review of equilibrium principles; forces and moments transmitted by slender members. Concepts of stress and strain. Stress-strain relations with focus on linear elasticity. Transformation of stress and strain. Deformations and stresses caused by tension, compression, bending, shear, and torsion of slender members. Structural applications to trusses, beams, shafts, and columns. Introduction to virtual work principle. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 91"},{"type": "requisite","course": "MECH&AE 101"}]},
            {"type": "requisite","course": "MATH 32B"},
            {"type": "requisite","course": "PHYSICS 1A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 108L",
        "title": "Experimental Structural Mechanics",
        "units": 4,
        "description": "Lecture, two hours; laboratory, six hours; outside study, four hours. Requisite or corequisite: course 108. Lectures and laboratory experiments in various structural mechanics testing of metals (steel, aluminum, brass), high-strength plastics, and concrete (cylinders, beams). Direct tension. Direct compression. Ultrasonic nondestructive evaluation. Elastic buckling of columns. Fracture mechanics testing and fracture toughness. Splitting tension and flexural tension. Elastic, plastic, and fracture behavior. ASTM and RILEM. Cyclic loading. Microstructures of concrete. Size effects. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 108"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 109W",
        "title": "Ethics in Civil and Environmental Engineering",
        "units": 5,
        "description": "Lecture, four hours; discussion, two hours; outside study, nine hours. Requisite: English Composition 3 or equivalent. Introduction to ethical and societal considerations in the professional practice of civil and environmental engineering. Exploration of ethical and moral principles, roles and responsibilities of engineers, and social and equity impacts of engineering. Review of civil and environmental engineering case studies, sustainability projects, and emerging technologies in detail; and development of strong arguments. Students draft 15-20 pages of revised prose and complete informal writing assignments. Satisfies engineering ethics requirement. Satisfies Writing II requirement. May be repeated once for credit. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "ENGCOMP 3"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 110",
        "title": "Introduction to Probability and Statistics for Engineers",
        "units": 4,
        "description": "Lecture, four hours; discussion, one hour (when scheduled); outside study, seven hours. Requisites: Mathematics 32A, 33A. Recommended: course M20. Introduction to fundamental concepts and applications of probability and statistics in civil engineering, with focus on how these concepts are used in experimental design and sampling, data analysis, risk and reliability analysis, and project design under uncertainty. Topics include basic probability concepts, random variables and analytical probability distributions, functions of random variables, estimating parameters from observational data, regression, hypothesis testing, and Bayesian concepts. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "MATH 32A"},
            {"type": "requisite","course": "MATH 33A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 116XP",
        "title": "Engineering and Environmental Justice",
        "units": 5,
        "description": "Lecture, four hours; discussion, one hour; service learning, two hours; outside study, eight hours. Introduction to concept of environmental justice. Examination of methods for assessing disparities in exposure to environmental hazards. Exploration of how engineers can partner with community to address local environmental issues. Along with case study analyses, students collaborate with community-based organizations on real-world projects. Topics include water quality; air quality; energy justice; climate justice; community resilience; race, ethnicity, and class; expertise; and community-based participatory research. May be repeated once for credit. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 120",
        "title": "Principles of Soil Mechanics",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 108. Soil as foundation for structures and as material of construction. Soil formation, classification, physical and mechanical properties, soil compaction, earth pressures, consolidation, and shear strength. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 108"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 120L",
        "title": "Soil Mechanics Laboratory",
        "units": 4,
        "description": "(Formerly numbered 128L.) Lecture, one hour; laboratory, six hours; outside study, five hours. Requisite or corequisite: course 120. Laboratory experiments to be performed by students to obtain soil parameters required for assigned design problems. Soil classification, grain size distribution, Atterberg limits, specific gravity, compaction, expansion index, consolidation, shear strength determination. Design problems, laboratory report writing. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 120"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 121",
        "title": "Design of Foundations and Earth Structures",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 120. Design methods for foundations and earth structures. Site investigation, including evaluation of soil properties for design. Design of footings and piles, including stability and settlement calculations. Design of slopes and earth retaining structures. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 120"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 123",
        "title": "Advanced Geotechnical Design",
        "units": 4,
        "description": "(Formerly numbered C123.) Lecture, two hours; discussion, two hours; active learning, two hours; outside study, six hours. Requisites: courses 121, 190. Corequisite: course 132. Slope stability analysis, including limit equilibrium procedures, finite element method, seepage analysis, and advanced topics such as rapid drawdown, construction of embankments on soft soil, and seismic slope stability. Lateral earth retention systems including gravity walls and excavation support systems. Capstone design project involving appropriate engineering standards and realistic constraints. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 121"},
            {"type": "requisite","course": "C&EE 190"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 125",
        "title": "Fundamentals of Earthquake Engineering",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 135A. Overview of engineering seismology, including plate tectonics, faults, wave propagation, and earthquake strong ground motion. Development and selection of design ground motions using both probabilistic seismic hazard analysis and code-based methods. Overview of seismic design regulation and California PE examination's seismic component. Code-based seismic design for new buildings using current International Building Code seismic code provisions. Overview of seismic design of bridges, dams, and other non-building structures. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 135A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 129L",
        "title": "Engineering Geomatics",
        "units": 4,
        "description": "Lecture, two hours; laboratory, four hours; outside study, six hours. Collection, processing, and analysis of geospatial data. Ellipsoid and geoid models of shape of Earth. Sea level, height, and geopotential surfaces. Elements and usage of topographic data and maps. Advanced global positioning systems (GPS) for high-precision mapping. Advanced laser-based light detection and ranging (LIDAR) mapping. Quantitative terrain analysis and change detection. Hydrogeomatics: seafloor mapping. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 130",
        "title": "Elementary Structural Mechanics",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 108. Analysis of stress and strain, phenomenological material behavior, extension, bending, and transverse shear stresses in beams with general cross-sections, shear center, deflection of beams, torsion of beams, warping, column instability and failure. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 108"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 132",
        "title": "Dynamics of Rigid and Flexible Structures",
        "units": 4,
        "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisites: course 91, Physics 1B. Covers kinematics and kinetics of rigid bodies using equilibrium, work and energy, free and forced response of discrete single-degree-of-freedom and two-degrees-of-freedom flexible structures, and introduction to shock spectra. May be repeated once for credit. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 91"},
            {"type": "requisite","course": "PHYSICS 1B"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 135A",
        "title": "Elementary Structural Analysis",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Enforced requisites: courses M20 (or Computer Science 31), 108. Introduction to structural analysis; classification of structural elements; analysis of statically determinate trusses, beams, and frames; deflections in elementary structures; virtual work; analysis of indeterminate structures using force method; introduction to displacement method and energy concepts. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE M20"},{"type": "requisite","course": "COM SCI 31"}]},
            {"type": "requisite","course": "C&EE 108"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 135B",
        "title": "Intermediate Structural Analysis",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 135A. Analysis of truss and frame structures using matrix methods; matrix force methods; matrix displacement method; analysis concepts based on theorem of virtual work; moment distribution. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 135A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 135L",
        "title": "Structural Design and Testing Laboratory",
        "units": 4,
        "description": "Lecture, two hours; laboratory, five hours; outside study, five hours. Requisites: courses M20, 135A. Limited enrollment. Computer-aided optimum design, construction, instrumentation, and test of small-scale model structure. Use of computer-based data acquisition and interpretation systems for comparison of experimental and theoretically predicted behavior. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE M20"},
            {"type": "requisite","course": "C&EE 135A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 137L",
        "title": "Structural Dynamics Laboratory",
        "units": 4,
        "description": "Lecture, two hours; laboratory, six hours; outside study, four hours. Requisite or corequisite: course 137. Calibration of instrumentation for dynamic measurements. Determination of natural frequencies and damping factors from free vibrations. Determination of natural frequencies, mode shapes, and damping factors from forced vibrations. Dynamic similitude. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 137"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 140L",
        "title": "Structural Components and Systems Testing Laboratory",
        "units": 4,
        "description": "Lecture, two hours; laboratory, six hours; outside study, four hours. Enforced requisite: course 142. Comparison of experimental results with analytical results and code requirements to assess accuracies and limitations of calculation procedures used in structural design. Tests include quasi-static tests of structural elements (beams, columns) and systems (slab-column, beam-column) and dynamic tests of simple building systems. Quasi-static tests focus on assessment of element or subsystem stiffness, strength, and deformation capacity, whereas dynamic tests focus on assessment of periods, mode shapes, and damping. Development of communication skills through preparation of laboratory reports and oral presentations. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 142"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 141",
        "title": "Steel Structures",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 135A. Introduction to building codes. Fundamentals of load and resistance factor design of steel elements. Design of tension and compression members. Design of beams and beam columns. Simple connection design. Introduction to computer modeling methods and design process. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 135A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 142",
        "title": "Design of Reinforced Concrete Structures",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 135A. Beams, columns, and slabs in reinforced concrete structures. Properties of reinforced concrete materials. Design of beams and slabs for flexure, shear, anchorage of reinforcement, and deflection. Design of columns for axial force, bending, and shear. Ultimate strength design methods. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 135A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 142L",
        "title": "Reinforced Concrete Structural Laboratory",
        "units": 4,
        "description": "Lecture, two hours; laboratory, six hours; outside study, four hours. Requisites: courses 135B, 142. Limited enrollment. Design considerations used for reinforced concrete beams, columns, slabs, and joints evaluated using analysis and experiments. Links between theory, building codes, and experimental results. Students demonstrate accuracies and limitations of calculation procedures used in design of reinforced concrete structures. Development of skills for written and oral presentations. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 135B"},
            {"type": "requisite","course": "C&EE 142"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 143",
        "title": "Design of Prestressed Concrete Structures",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 135A, 142. Equivalent loads and allowable flexural stresses in determinate and indeterminate systems. Flexural and shear strength design, including secondary effects in indeterminate systems. Design of indeterminate post-tensioned beam using both hand calculations and commercially available computer program. Discussion of external post-tensioning, one- and two-way slab systems. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 135A"},
            {"type": "requisite","course": "C&EE 142"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 144",
        "title": "Structural Systems Design",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 141 or 142, and 190. Corequisite: course 132. Design course for civil engineering students, with focus on design and performance of complete building structural systems. International Building Code (IBC) and ASCE 7 dead, live, wind, and earthquake loads. Design of reinforced concrete and structural steel buildings. Computer modeling, analysis, and performance assessment of buildings. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 141"},{"type": "requisite","course": "C&EE 142"}]},
            {"type": "requisite","course": "C&EE 190"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 147",
        "title": "Design and Construction of Tall Buildings",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 135B, 141, 190. Corequisite: course 132. Role of structural engineer, architect, and other design professions in design process. Development of architectural design of tall buildings. Influence of building code, zoning, and finance. Advantages and limitations of different structural systems. Development of structural system design and computer model for architectural design. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 135B"},
            {"type": "requisite","course": "C&EE 141"},
            {"type": "requisite","course": "C&EE 190"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 148",
        "title": "Wood and Timber Design",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Recommended requisites: courses 108, 135A. Properties and behavior of wood and wood products, analysis and design of wood and timber structural members subjected to flexural, shear, and axial stresses; connections, fasteners, and detailing; and light-framed wood shear walls and diaphragms. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 150",
        "title": "Introduction to Hydrology",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Enforced requisites: courses M20 (or Computer Science 31), 107 (or Mechanical and Aerospace Engineering 103). Study of hydrologic cycle and relevant atmospheric processes, water and energy balance, radiation, precipitation formation, infiltration, evaporation, vegetation transpiration, groundwater flow, storm runoff, and flood processes. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE M20"},{"type": "requisite","course": "COM SCI 31"}]},
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 107"},{"type": "requisite","course": "MECH&AE 103"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 151",
        "title": "Introduction to Water Resources Engineering",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Enforced requisites: courses 107 (or Mechanical and Aerospace Engineering 103), 150. Recommended: courses 103, 110. Principles of hydraulics, flow of water in open channels and pressure conduits, reservoirs and dams, hydraulic machinery, hydroelectric power. Introduction to system analysis and design applied to water resources engineering. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 107"},{"type": "requisite","course": "MECH&AE 103"}]},
            {"type": "requisite","course": "C&EE 150"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 152",
        "title": "Hydraulic and Hydrologic Design",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Enforced requisites: courses 150, 151, 190. Analysis and design of hydraulic and hydrologic systems, including stormwater management systems, potable and recycled water distribution systems, wastewater collection systems, and constructed wetlands. Emphasis on practical design components, including reading/interpreting professional drawings and documents, environmental impact reports, permitting, agency coordination, and engineering ethics. Project-based course includes analysis of alternative designs, use of engineering economics, and preparation of written engineering reports. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 150"},
            {"type": "requisite","course": "C&EE 151"},
            {"type": "requisite","course": "C&EE 190"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 153",
        "title": "Introduction to Environmental Engineering Science",
        "units": 4,
        "description": "Lecture, four hours; discussion, one hour (when scheduled); outside study, seven hours; field trip. Recommended requisite: course 107 (or Mechanical and Aerospace Engineering 103). Water, air, and soil pollution: sources, transformations, effects, and processes for removal of contaminants. Water quality, water and wastewater treatment, waste disposal, air pollution, global environmental problems. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 154",
        "title": "Chemical Fate and Transport in Aquatic Environments",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Recommended requisite: course 153. Fundamental physical, chemical, and biological principles governing movement and fate of chemicals in surface waters and groundwater. Topics include physical transport in various aquatic environments, air-water exchange, acid-base equilibria, oxidation-reduction chemistry, chemical sorption, biodegradation, and bioaccumulation. Practical quantitative problems solved considering both reaction and transport of chemicals in environment. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 155",
        "title": "Unit Operations and Processes for Water and Wastewater Treatment",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 153. Biological, chemical, and physical methods used to modify water quality. Fundamentals of phenomena governing design of engineered systems for water and wastewater treatment systems. Field trip. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 153"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 156A",
        "title": "Environmental Chemistry Laboratory",
        "units": 4,
        "description": "Lecture, four hours; laboratory, four hours; outside study, four hours. Requisites: course 153 (may be taken concurrently), Chemistry 20A, 20B. Basic laboratory techniques in analytical chemistry related to water and wastewater analysis. Selected experiments include gravimetric analysis, titrimetry spectrophotometry, redox systems, pH and electrical conductivity. Concepts to be applied to analysis of real water samples in course 156B. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 153"},
            {"type": "requisite","course": "CHEM 20A"},
            {"type": "requisite","course": "CHEM 20B"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 156B",
        "title": "Environmental Engineering Unit Operations and Processes Laboratory",
        "units": 4,
        "description": "Lecture, two hours; laboratory, six hours; outside study, four hours. Requisites: Chemistry 20A, 20B. Characterization and analysis of typical natural waters and wastewaters for inorganic and organic constituents. Selected experiments include analysis of solids, nitrogen species, oxygen demand, and chlorine residual, that are used in unit operation experiments that include reactor dynamics, aeration, gas stripping, coagulation/flocculation, and membrane separation. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "CHEM 20A"},
            {"type": "requisite","course": "CHEM 20B"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 157A",
        "title": "Hydrologic Modeling",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Enforced requisite: course 150 or 151. Introduction to hydrologic modeling. Topics selected from areas of (1) open-channel flow, including one-dimensional steady flow and unsteady flow, (2) pipe flow and water distribution systems, (3) rainfall-runoff modeling, and (4) groundwater flow and contaminant transport modeling, with focus on use of industry and/or research standard models with locally relevant applications. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 150"},{"type": "requisite","course": "C&EE 151"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 157B",
        "title": "Design of Water Treatment Plants",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 155, 190. Water quality standards and regulations, overview of water treatment plants, design of unit operations, predesign of water treatment plants, hydraulics of plants, process control, and cost estimation. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 155"},
            {"type": "requisite","course": "C&EE 190"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 157C",
        "title": "Design of Wastewater Treatment Plants",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 155, 190. Process design of wastewater treatment plants, including primary and secondary treatment, detailed design review of existing plants, process control, and economics. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 155"},
            {"type": "requisite","course": "C&EE 190"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 157L",
        "title": "Hydrologic Analysis",
        "units": 4,
        "description": "Lecture, two hours; laboratory, five hours; outside study, five hours. Requisite: course 150. Collection, compilation, and interpretation of data for quantification of components of hydrologic cycle, including precipitation, evaporation, infiltration, and runoff. Use of hydrologic variables and parameters for development, construction, and application of analytical models for selected problems in hydrology and water resources. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 150"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 170",
        "title": "Introduction to Construction Management",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Introduction to construction engineering theory, management, and techniques. Implementation of exercises from academic texts and real project case studies. Discussion of building systems, building components, project delivery methods, document control, critical path method scheduling, labor management, quality management, estimating, sustainability, and cost controls. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 180",
        "title": "Introduction to Transportation Engineering",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Designed for juniors/senior Civil Engineering students and Public Affairs graduate students. General characteristics of transportation systems, including streets and highways, rail, transit, air, and water. Capacity considerations, including planning, design, and operations. Components of roadway design, including horizontal and vertical alignment, cross sections, and pavements. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 188",
        "title": "Special Courses in Civil and Environmental Engineering",
        "units": 4,
        "description": "Lecture, to be arranged; discussion, to be arranged (when scheduled); outside study, to be arranged. Special topics in civil engineering for undergraduate students taught on experimental or temporary basis, such as those taught by resident and visiting faculty members. May be repeated for credit with topic or instructor change. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 19",
        "title": "Fiat Lux Freshman Seminars",
        "units": 1,
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 190",
        "title": "Professional Practice",
        "units": 2,
        "description": "Lecture, two hours; discussion; one hour; outside study, three hours. Requisite: one course from 121, 141, 142, 151, 155 (may be taken concurrently). Sustainability in design (e.g., LEED certification for building projects), professional licensure (PE, SE, and GE), project management (proposals, scheduling, and budgeting), business, public policy, leadership, ethics, earthquake loads, wind loads, load combinations, and environmental impact reports. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 121"},{"type": "requisite","course": "C&EE 141"},{"type": "requisite","course": "C&EE 142"},{"type": "requisite","course": "C&EE 151"},{"type": "requisite","course": "C&EE 155"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 194",
        "title": "Research Group Seminars: Civil and Environmental Engineering",
        "units": 2,
        "description": "Seminar, two to eight hours; outside study, four to 16 hours. Designed for undergraduate students who are part of research group. Discussion of research methods and current literature in field or of research of faculty members or students. May be repeated for credit. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 199",
        "title": "Directed Research in Civil and Environmental Engineering",
        "units": 2,
        "description": "Tutorial, to be arranged. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit with school approval. Individual contract required; enrollment petitions available in Office of Academic and Student Affairs. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 200",
        "title": "Civil and Environmental Engineering Graduate Seminar",
        "units": 2,
        "description": "Seminar, four hours; outside study, two hours. Various topics in civil and environmental engineering that may include earthquake engineering, environmental engineering, geotechnical engineering, hydrology and water resources engineering, materials engineering, structural engineering, and structural mechanics. May be repeated for credit. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 220",
        "title": "Advanced Soil Mechanics",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 120. State of stress. Consolidation and settlement analysis. Shear strength of granular and cohesive soils. In situ and laboratory methods for soil property evaluation. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 120"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 221",
        "title": "Advanced Foundation Engineering",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 121, 220. Stress distribution. Bearing capacity and settlement of shallow foundations, including spread footings and mats. Performance of driven pile and drilled shaft foundations under vertical and lateral loading. Construction considerations. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 121"},
            {"type": "requisite","course": "C&EE 220"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 222",
        "title": "Unsaturated Soil Mechanics",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Properties and engineering behavior of multiphase soil systems; thermodynamics, interfacial physics, mechanics, and hydrology perspectives to understand unsaturated soil mechanics principles; geoengineering problems that involves unsaturated soils (e.g., precipitation-induced landslides, expansive soils, bearing capacity and settlement of shallow foundations, pavement and roadway drainage design, design and monitoring of waste containment facilities). May be repeated once for credit. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 223",
        "title": "Advanced Geotechnical Design",
        "units": 4,
        "description": "(Formerly numbered C223.) Lecture, four hours; outside study, eight hours. Requisite: course 220. Slope stability analysis, including limit equilibrium procedures, finite element method, seepage analysis, and advanced topics such as rapid drawdown, construction of embankments on soft soil, and seismic slope stability. Lateral earth retention systems including gravity walls and excavation support systems. Advanced analysis methods and design project involving real landslide problem. Emphasis on preparation of professional engineering documents such as proposals, work acknowledgements, figures, plans, and reports. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 220"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 225",
        "title": "Geotechnical Earthquake Engineering",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 220, 245 (may be taken concurrently). Analysis of earthquake-induced ground failure, including soil liquefaction, cyclic softening of clays, seismic compression, surface fault rupture, and seismic slope stability. Ground response effects on earthquake ground motions. Soil-structure interaction, including inertial and kinematic interaction and foundation deformations under seismic loading. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 220"},
            {"type": "requisite","course": "C&EE 245"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 226",
        "title": "Geoenvironmental Engineering",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 120. Field of geoenvironmental engineering involves application of geotechnical principles to environmental problems. Topics include environmental regulations, waste characterization, geosynthetics, solid waste landfills, subsurface barrier walls, and disposal of high water content materials. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 120"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 227",
        "title": "Numerical Methods in Geotechnical Engineering",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 220. Introduction to basic concepts of computer modeling of soils using finite element method, and to constitutive modeling based on elasticity and plasticity theories. Special emphasis on numerical applications and identification of modeling concerns such as instability, bifurcation, nonexistence, and nonuniqueness of solutions. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 220"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 232",
        "title": "Theory of Plates and Shells",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 130. Small and large deformation theories of thin plates; energy methods; free vibrations; membrane theory of shells; axisymmetric deformations of cylindrical and spherical shells, including bending. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 130"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 233",
        "title": "Mechanics of Composite Material Structures",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisites: courses M230B, 232. Elastic, anisotropic stress-strain-temperature relations. Analysis of prismatic beams by three-dimensional elasticity. Analysis of laminated anisotropic plates and shells based on classical and first-order shear deformation theories. Elastodynamic behavior of laminated plates and cylinders. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE M230B"},
            {"type": "requisite","course": "C&EE 232"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 235A",
        "title": "Advanced Structural Analysis",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 135A. Recommended: course 135B. Review of matrix force and displacement methods of structural analysis; virtual work theorem, virtual forces, and displacements; theorems on stationary value of total and complementary potential energy, minimum total potential energy, Maxwell/Betti theorems, effects of approximations, introduction to finite element analysis. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 135A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 235B",
        "title": "Finite Element Analysis of Structures",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 130, 235A. Direct energy formulations for deformable systems; solution methods for linear equations; analysis of structural systems with one-dimensional elements; introduction to variational calculus; discrete element displacement, force, and mixed methods for membrane, plate, shell structures; instability effects. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 130"},
            {"type": "requisite","course": "C&EE 235A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 235C",
        "title": "Nonlinear Structural Analysis",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 235B. Classification of nonlinear effects; material nonlinearities; conservative, nonconservative material behavior; geometric nonlinearities, Lagrangian, Eulerian description of motion; finite element methods in geometrically nonlinear problems; postbuckling behavior of structures; solution of nonlinear equations; incremental, iterative, programming methods. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 235B"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 236",
        "title": "Stability of Structures I",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 130 or 135B. Elastic buckling of bars. Different approaches to stability problems. Inelastic buckling of columns and beam columns. Columns and beam columns with linear, nonlinear creep. Combined torsional and flexural buckling of columns. Buckling of plates. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 130"},{"type": "requisite","course": "C&EE 135B"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 238",
        "title": "Computational Solid Mechanics",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 235B. Advanced finite element and meshfree methods for computational solid mechanics. Stability and consistency in temporal discretization of parabolic and hyperbolic systems. Analysis of numerical dissipation and dispersion. Multifield variational principles for constrained problems. Meshfree methods: approximation theories, Galerkin meshfree methods, collocation meshfree methods, imposition of boundary conditions, domain integration, stability. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 235B"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 238",
        "title": "Computational Solid Mechanics",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 235B. Advanced finite element and meshfree methods for computational solid mechanics. Stability and consistency in temporal discretization of parabolic and hyperbolic systems. Analysis of numerical dissipation and dispersion. Multifield variational principles for constrained problems. Meshfree methods: approximation theories, Galerkin meshfree methods, collocation meshfree methods, imposition of boundary conditions, domain integration, stability. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 235B"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 239",
        "title": "Elementary Structural Dynamics",
        "units": 4,
        "description": "(Formerly numbered C239.) Lecture, four hours; discussion, two hours; outside study, six hours. Recommended requisite: course 135B. Basic structural dynamics course for civil engineering students. Elastic free and forced vibrations of single degree of freedom systems, introduction to response history and response spectrum analysis approaches for single and multi-degree-of-freedom systems. Axial, bending, and torsional vibration of beams. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 239",
        "title": "Elementary Structural Dynamics",
        "units": 4,
        "description": "(Formerly numbered C239.) Lecture, four hours; discussion, two hours; outside study, six hours. Recommended requisite: course 135B. Basic structural dynamics course for civil engineering students. Elastic free and forced vibrations of single degree of freedom systems, introduction to response history and response spectrum analysis approaches for single and multi-degree-of-freedom systems. Axial, bending, and torsional vibration of beams. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 241",
        "title": "Advanced Steel Structures",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses C137, 141, 235A. Performance characterization of steel structures for static and earthquake loads. Behavior state analysis and building code provisions for special moment resisting, braced, and eccentric braced frames. Composite steel-concrete structures. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE C137"},
            {"type": "requisite","course": "C&EE 141"},
            {"type": "requisite","course": "C&EE 235A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 241",
        "title": "Advanced Steel Structures",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses C137, 141, 235A. Performance characterization of steel structures for static and earthquake loads. Behavior state analysis and building code provisions for special moment resisting, braced, and eccentric braced frames. Composite steel-concrete structures. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE C137"},
            {"type": "requisite","course": "C&EE 141"},
            {"type": "requisite","course": "C&EE 235A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 243A",
        "title": "Behavior and Design of Reinforced Concrete Structural Elements",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 142. Advanced topics on design of reinforced concrete structures, including stress-strain relationships for plain and confined concrete, moment-curvature analysis of sections, and design for shear. Design of slender and low-rise walls, as well as design of beam-column joints. Introduction to displacement-based design and applications of strut-and-tie models. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 142"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 243A",
        "title": "Behavior and Design of Reinforced Concrete Structural Elements",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 142. Advanced topics on design of reinforced concrete structures, including stress-strain relationships for plain and confined concrete, moment-curvature analysis of sections, and design for shear. Design of slender and low-rise walls, as well as design of beam-column joints. Introduction to displacement-based design and applications of strut-and-tie models. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 142"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 243B",
        "title": "Response and Design of Reinforced Concrete Structural Systems",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 243A, 246. Information on response and behavior of reinforced concrete buildings to earthquake ground motions. Topics include use of elastic and inelastic response spectra, role of strength, stiffness, and ductility in design, use of prescriptive versus performance-based design methodologies, and application of elastic and inelastic analysis techniques for new and existing construction. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 243A"},
            {"type": "requisite","course": "C&EE 246"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 243B",
        "title": "Response and Design of Reinforced Concrete Structural Systems",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 243A, 246. Information on response and behavior of reinforced concrete buildings to earthquake ground motions. Topics include use of elastic and inelastic response spectra, role of strength, stiffness, and ductility in design, use of prescriptive versus performance-based design methodologies, and application of elastic and inelastic analysis techniques for new and existing construction. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 243A"},
            {"type": "requisite","course": "C&EE 246"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 244",
        "title": "Structural Reliability",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Introduction to concepts and applications of structural reliability. Topics include computing first- and second-order estimates of failure probabilities of engineered systems, computing sensitivities of failure probabilities to assumed parameter values, measuring relative importance of random variables associated with systems, identifying relative advantages and disadvantages of various analytical reliability methods, using reliability tools to calibrate simplified building codes, and performing reliability calculations related to performance-based engineering. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 244",
        "title": "Structural Reliability",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Introduction to concepts and applications of structural reliability. Topics include computing first- and second-order estimates of failure probabilities of engineered systems, computing sensitivities of failure probabilities to assumed parameter values, measuring relative importance of random variables associated with systems, identifying relative advantages and disadvantages of various analytical reliability methods, using reliability tools to calibrate simplified building codes, and performing reliability calculations related to performance-based engineering. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 245",
        "title": "Earthquake Ground Motion Characterization",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Corequisite: course C137 or 246. Earthquake fundamentals, including plate tectonics, fault types, seismic waves, and magnitude scales. Characterization of earthquake source, including magnitude range and rate of future earthquakes. Ground motion prediction equations and site effects on ground motion. Seismic hazard analysis. Ground motion selection and modification for response history analysis. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 245",
        "title": "Earthquake Ground Motion Characterization",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Corequisite: course C137 or 246. Earthquake fundamentals, including plate tectonics, fault types, seismic waves, and magnitude scales. Characterization of earthquake source, including magnitude range and rate of future earthquakes. Ground motion prediction equations and site effects on ground motion. Seismic hazard analysis. Ground motion selection and modification for response history analysis. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 246",
        "title": "Structural Response to Ground Motions",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses C137, 141, 142, 235A. Spectral analysis of ground motions: response, time, and Fourier spectra. Response of structures to ground motions due to earthquakes. Computational methods to evaluate structural response. Response analysis, including evaluation of contemporary design standards. Limitations due to idealizations. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE C137"},
            {"type": "requisite","course": "C&EE 141"},
            {"type": "requisite","course": "C&EE 142"},
            {"type": "requisite","course": "C&EE 235A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 246",
        "title": "Structural Response to Ground Motions",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses C137, 141, 142, 235A. Spectral analysis of ground motions: response, time, and Fourier spectra. Response of structures to ground motions due to earthquakes. Computational methods to evaluate structural response. Response analysis, including evaluation of contemporary design standards. Limitations due to idealizations. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE C137"},
            {"type": "requisite","course": "C&EE 141"},
            {"type": "requisite","course": "C&EE 142"},
            {"type": "requisite","course": "C&EE 235A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 247",
        "title": "Earthquake Hazard Mitigation",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 130, and M237A or 246. Concept of seismic isolation, linear theory of base isolation, visco-elastic and hysteretic behavior, elastomeric bearings under compression and bending, buckling of bearings, sliding bearings, passive energy dissipation devices, response of structures with isolation and passive energy dissipation devices, static and dynamic analysis procedures, code provisions and design methods for seismically isolated structures. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 130"},
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE M237A"},{"type": "requisite","course": "C&EE 246"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 247",
        "title": "Earthquake Hazard Mitigation",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 130, and M237A or 246. Concept of seismic isolation, linear theory of base isolation, visco-elastic and hysteretic behavior, elastomeric bearings under compression and bending, buckling of bearings, sliding bearings, passive energy dissipation devices, response of structures with isolation and passive energy dissipation devices, static and dynamic analysis procedures, code provisions and design methods for seismically isolated structures. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 130"},
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE M237A"},{"type": "requisite","course": "C&EE 246"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 248",
        "title": "Fundamentals of Smart Infrastructure",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Students are exposed to the foundations of smart infrastructure, which include the working principles of sensors such as accelerometers, strain gauges, cameras, and data processing methods. Topics include basic foundations of signal (1D) and image (2D) processing, experimental/operational modal analysis of structures, structural health monitoring from visual sensors, and computer vision applications for the assessment of engineered infrastructure. May be repeated once for credit. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 248",
        "title": "Fundamentals of Smart Infrastructure",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Students are exposed to the foundations of smart infrastructure, which include the working principles of sensors such as accelerometers, strain gauges, cameras, and data processing methods. Topics include basic foundations of signal (1D) and image (2D) processing, experimental/operational modal analysis of structures, structural health monitoring from visual sensors, and computer vision applications for the assessment of engineered infrastructure. May be repeated once for credit. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 250A",
        "title": "Surface Water Hydrology",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 150. In-depth study of surface water hydrology, including discussion and interrelationship of major topics such as rainfall and evaporation, soils and infiltration properties, runoff and snowmelt processes. Introduction to rainfall-runoff modeling, floods, and policy issues involved in water resource engineering and management. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 150"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 250B",
        "title": "Groundwater Hydrology",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 150. Theory of movement and occurrence of water in subterranean aquifers. Steady flow in confined and unconfined aquifers. Mechanics of wells; steady and unsteady radial flows in confined and unconfined aquifers. Theory of leaky aquifers. Parameter estimation. Seawater intrusion. Numerical methods. Applications. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 150"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 250C",
        "title": "Hydrometeorology",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 250A. In-depth study of hydrometeorological processes. Role of hydrology in climate system, precipitation and evaporation processes, atmospheric radiation, exchange of mass, heat, and momentum between soil and vegetation surface and overlying atmosphere, flux and transport in turbulent boundary layer, basic remote sensing principles. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 250A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 250D",
        "title": "Water Resources Systems Engineering",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 151. Application of mathematical programming techniques to water resources systems. Topics include reservoir management and operation; optimal timing, sequencing and sizing of water resources projects; and multiobjective planning and conjunctive use of surface water and groundwater. Emphasis on management of water quantity. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 151"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 251A",
        "title": "Rainfall-Runoff Modeling",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 250A, 251B. Introduction to hydrologic modeling concepts, including rainfall-runoff analysis, input data, uncertainty analysis, lumped and distributed modeling, parameter estimation and sensitivity analysis, and application of models for flood forecasting and prediction of streamflows in water resource applications. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 250A"},
            {"type": "requisite","course": "C&EE 251B"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 251B",
        "title": "Contaminant Transport in Groundwater",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 250B, 253. Phenomena and mechanisms of hydrodynamic dispersion, governing equations of mass transport in porous media, various analytical and numerical solutions, determination of dispersion parameters by laboratory and field experiments, biological and reactive transport in multiphase flow, remediation design, software packages and applications. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 250B"},
            {"type": "requisite","course": "C&EE 253"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 251C",
        "title": "Remote Sensing with Hydrologic Applications",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 250A, 250C. Introduction to basic physical concepts of remote sensing as they relate to surface and atmospheric hydrologic processes. Applications include radiative transfer modeling and retrieval of hydrologically relevant parameters like topography, soil moisture, snow properties, vegetation, and precipitation. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 250A"},
            {"type": "requisite","course": "C&EE 250C"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 251D",
        "title": "Hydrologic Data Assimilation",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 250A, 250C. Introduction to basic concepts of classical and Bayesian estimation theory for purposes of hydrologic data assimilation. Applications geared toward assimilating disparate observations into dynamic models of hydrologic systems. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 250A"},
            {"type": "requisite","course": "C&EE 250C"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 251E",
        "title": "Environmental Data Analysis",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Recommended preparation: some knowledge of MATLAB or Python. Covers methods for analyzing time series and spatial data within the context of environmental datasets (both air and water). Techniques covered include regressions, correlations, interpolations, spectral analysis, empirical orthogonal functions, clustering, and random forest. Focus on practical applications. Culminates in a final project where students apply these techniques to a research question of their choice. May be repeated once for credit. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 252",
        "title": "Engineering Economic Analysis of Water and Environmental Planning",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Enforced requisites: Engineering 110, one or more courses from Economics 1, 2, 11, 101. Economic theory and applications in analysis and management of water and environmental problems; application of price theory to water resource management and renewable resources; benefit-cost analysis with applications to water resources and environmental planning. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "ENGR 110"},
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "ECON 1"},{"type": "requisite","course": "ECON 2"},{"type": "requisite","course": "ECON 11"},{"type": "requisite","course": "ECON 101"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 253",
        "title": "Mathematical Models for Water Quality Management",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 153. Development of mathematical models for simulating environmental engineering problems. Emphasis on numerical techniques to solve nonlinear partial differential equations and their application to environmental engineering problems. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 153"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 254A",
        "title": "Environmental Aquatic Inorganic Chemistry",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: Chemistry 20B, Mathematics 31A, 31B, Physics 1A, 1B. Equilibrium and kinetic descriptions of chemical behavior of metals and inorganic ions in natural fresh/marine surface waters and in water treatment. Processes include acid-base chemistry and alkalinity (carbonate system), complexation, precipitation/dissolution, absorption oxidation/reduction, and photochemistry. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "CHEM 20B"},
            {"type": "requisite","course": "MATH 31A"},
            {"type": "requisite","course": "MATH 31B"},
            {"type": "requisite","course": "PHYSICS 1A"},
            {"type": "requisite","course": "PHYSICS 1B"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 255A",
        "title": "Physical and Chemical Processes for Water and Wastewater Treatment",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 155, 254A. Review of momentum and mass transfer, chemical reaction engineering, coagulation and flocculation, granular filtrations, sedimentation, carbon adsorption, gas transfer, disinfection, oxidation, and membrane processes. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 155"},
            {"type": "requisite","course": "C&EE 254A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 255B",
        "title": "Biological Processes for Water and Wastewater Treatment",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 254A, 255A. Fundamentals of environmental engineering microbiology; kinetics of microbial growth and biological oxidation; applications for activated sludge, gas transfer, fixed-film processes, aerobic and anaerobic digestion, sludge disposal, and biological nutrient removal. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 254A"},
            {"type": "requisite","course": "C&EE 255A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 258A",
        "title": "Membrane Separations in Aquatic Systems",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 254A. Applications of membrane separations to desalination, water reclamation, brine disposal, and ultrapure water systems. Discussion of reverse osmosis, ultrafiltration, electrodialysis, and ion exchange technologies from both practical and theoretical standpoints. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 254A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 260",
        "title": "Advanced Topics in Hydrology and Water Resources",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 250A, 250B, 250D. Current research topics in inverse problem of parameter estimation, experimental design, conjunctive use of surface and groundwater, multiobjective water resources planning, and optimization of water resource systems. Topics may vary from term to term. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 250A"},
            {"type": "requisite","course": "C&EE 250B"},
            {"type": "requisite","course": "C&EE 250D"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 261",
        "title": "Colloidal Phenomena in Aquatic Systems",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 254A, 255A. Colloidal interactions, colloidal stability, colloidal hydrodynamics, surface chemistry, adsorption of pollutants on colloidal surfaces, transport of colloids in porous media, coagulation, and particle deposition. Consideration of applications to colloidal processes in aquatic environments. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 254A"},
            {"type": "requisite","course": "C&EE 255A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 261A",
        "title": "Advanced Water Treatment Processes",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 255A. In-depth coverage of advanced water treatment processes, including advanced oxidation processes, photolysis, electrochemical treatment methods, and membrane separations. These advanced processes are increasingly necessary to adequately treat both drinking and wastewater. Study of process fundamentals and cutting-edge technologies in detail for thorough understanding of advantages and challenges associated with application of these processes. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 255A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 261B",
        "title": "Advanced Biological Processes for Water and Wastewater Treatment",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 255B. In-depth treatment of selected topics related to biological treatment of waters and wastewaters, such as biodegradation of xenobiotics, pharmaceuticals, emerging pollutants, toxicity, and nutrients. Discussion of theoretical aspects, experimental observations, and recent literature. Application to important and emerging environmental problems. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 255B"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 263A",
        "title": "Physics of Environmental Transport",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Designed for graduate students. Transport processes in surface water, groundwater, and atmosphere. Emphasis on exchanges across phase boundaries: sediment/water interface; air/water gas exchange; particles, droplets, and bubbles; small-scale dispersion and mixing; effect of reactions on transport; linkages between physical, chemical, and biological processes. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 263B",
        "title": "Advanced Topics in Transport at Environmental Interfaces",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 263A. In-depth treatment of selected topics involving transport phenomena at environmental interfaces between solid, fluid, and gas phases, such as aquatic sediments, porous aggregates, and vegetative canopies. Discussion of theoretical models and experimental observations. Application to important environmental engineering problems. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 263A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 266",
        "title": "Environmental Biotechnology",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 153, 254A. Environmental biotechnology-concept and potential, biotechnology of pollutional control, bioremediation, biomass conversion: composting, biogas and bioethanol production. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 153"},
            {"type": "requisite","course": "C&EE 254A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 267",
        "title": "Environmental Applications of Geochemical Modeling",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 254A. Geochemical modeling is important tool for predicting environmental impacts of contamination. Hands-on experience in modeling using geochemical software packages commonly found in environmental consulting industry to gain better understanding of governing geochemical principles pertaining to movement and transformation of contaminants. Types of modeling include speciation, mineral solubility, surface complexation, reaction path, inverse mass balance, and reactive transport modeling. Case studies involve acid mine drainage, nuclear waste disposal, bioavailability and risk assessment, mine tailings and mining waste, deep well injection, landfill leachate, and microbial respiration. Research/modeling project required. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 254A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 296",
        "title": "Advanced Topics in Civil Engineering",
        "units": 2,
        "description": "Seminar, to be arranged. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 298",
        "title": "Seminar: Engineering",
        "units": 2,
        "description": "Seminar, to be arranged. Limited to graduate civil engineering students. Seminars may be organized in advanced technical fields. If appropriate, field trips may be arranged. May be repeated with topic change. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 495",
        "title": "Teaching Assistant Training Seminar",
        "units": 2,
        "description": "Seminar, two hours. Preparation: appointment as teaching assistant in Civil and Environmental Engineering Department. Seminar on communication of civil engineering principles, concepts, and methods; teaching assistant preparation, organization, and presentation of material, including use of visual aids; grading, advising, and rapport with students. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 58XP",
        "title": "Climate Change, Water Quality, and Ecosystem Functioning",
        "units": 5,
        "description": "Lecture, four hours; service learning, two hours; outside study, nine hours. Science related to climate change, water quality, and ecosystem health. Topics include carbon and nutrient cycling, hydrologic cycle, ecosystem structure and services, biodiversity, basic aquatic chemistry, and impacts of climate change on ecosystem functioning and water quality. Participation in series of science education projects to elementary or middle school audience. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 596",
        "title": "Directed Individual or Tutorial Studies",
        "units": 2,
        "description": "Tutorial, to be arranged. Limited to graduate civil engineering students. Petition forms to request enrollment may be obtained from assistant dean, Graduate Studies. Supervised investigation of advanced technical problems. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 597A",
        "title": "Preparation for MS Comprehensive Examination",
        "units": 2,
        "description": "Tutorial, to be arranged. Limited to graduate civil engineering students. Reading and preparation for MS comprehensive examination. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 597B",
        "title": "Preparation for PhD Preliminary Examination",
        "units": 2,
        "description": "Tutorial, to be arranged. Limited to graduate civil engineering students. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 597C",
        "title": "Preparation for PhD Oral Qualifying Examination",
        "units": 2,
        "description": "Tutorial, to be arranged. Limited to graduate civil engineering students. Preparation for oral qualifying examination, including preliminary research on dissertation. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 598",
        "title": "Research for and Preparation of MS Thesis",
        "units": 2,
        "description": "Tutorial, to be arranged. Limited to graduate civil engineering students. Supervised independent research for MS candidates, including thesis prospectus. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 599",
        "title": "Research for and Preparation of PhD Dissertation",
        "units": 2,
        "description": "Tutorial, to be arranged. Limited to graduate civil engineering students. Usually taken after students have been advanced to candidacy. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 91",
        "title": "Statics",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: Mathematics 31A, 31B, Physics 1A. Newtonian mechanics, vector representation, and resultant forces and moments. Free-body diagrams and equilibrium, internal loads and equilibrium in trusses, frames, and beams. Planar and nonplanar systems, distributed forces, determinate and indeterminate force systems, shear and moment diagrams, and axial force diagrams. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "MATH 31A"},
            {"type": "requisite","course": "MATH 31B"},
            {"type": "requisite","course": "PHYSICS 1A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 97",
        "title": "Variable Topics in Civil and Environmental Engineering",
        "units": 2,
        "description": "Seminar, two hours. Current topics and research methods in civil and environmental engineering. May be repeated for credit. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE 99",
        "title": "Student Research Program",
        "units": 1,
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C104",
        "title": "Structure, Processing, and Properties of Civil Engineering Materials",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: course 91 or Mechanical and Aerospace Engineering 101, Chemistry 20A, 20B, Mathematics 31A, 31B, 32B, Physics 1A, 1B, 1C. Corequisite: course 108. Discussion of aspects of cement and concrete materials, including manufacture of cement and production of concrete. Aspects of cement composition and basic chemical reactions, microstructure, properties of plastic and hardened concrete, chemical admixtures, and quality control and acceptance testing. Development and testing of fundamentals for complete understanding of overall response of all civil engineering materials. By end of term, successful utilization of fundamental materials science concepts to understand, explain, analyze, and describe engineering performance of civil engineering materials. Concurrently scheduled with course C204. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 91"},{"type": "requisite","course": "MECH&AE 101"}]},
            {"type": "requisite","course": "CHEM 20A"},
            {"type": "requisite","course": "CHEM 20B"},
            {"type": "requisite","course": "MATH 31A"},
            {"type": "requisite","course": "MATH 31B"},
            {"type": "requisite","course": "MATH 32B"},
            {"type": "requisite","course": "PHYSICS 1A"},
            {"type": "requisite","course": "PHYSICS 1B"},
            {"type": "requisite","course": "PHYSICS 1C"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C105",
        "title": "Structure and Properties of Amorphous Civil Engineering Materials",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: course 91 or Mechanical and Aerospace Engineering 101, Chemistry 20A, 20B, Mathematics 31A, 31B, 32B, Physics 1A, 1B, 1C. Corequisite: course 108. Nature and properties of amorphous civil engineering materials in fields of infrastructure and technology. Special attention to composition-structure-properties relationships and design and selection with respect to targeted civil engineering applications. Concurrently scheduled with course C205. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 91"},{"type": "requisite","course": "MECH&AE 101"}]},
            {"type": "requisite","course": "CHEM 20A"},
            {"type": "requisite","course": "CHEM 20B"},
            {"type": "requisite","course": "MATH 31A"},
            {"type": "requisite","course": "MATH 31B"},
            {"type": "requisite","course": "MATH 32B"},
            {"type": "requisite","course": "PHYSICS 1A"},
            {"type": "requisite","course": "PHYSICS 1B"},
            {"type": "requisite","course": "PHYSICS 1C"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C106",
        "title": "Modeling and Simulation of Civil Engineering Materials",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisites: Chemistry and Biochemistry 20A, 20B, Mathematics 31A, 31B, 32B, Physics 1A, 1B, 1C. Provides fundamental understanding of modeling and numerical simulations for civil engineering materials. Largely focused on practical examples and applications. By course end, students are expected to be able to independently run simulations at scale relevant to targeted problems. Concurrently scheduled with course C206. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "CHEM 20A"},
            {"type": "requisite","course": "CHEM 20B"},
            {"type": "requisite","course": "MATH 31A"},
            {"type": "requisite","course": "MATH 31B"},
            {"type": "requisite","course": "MATH 32B"},
            {"type": "requisite","course": "PHYSICS 1A"},
            {"type": "requisite","course": "PHYSICS 1B"},
            {"type": "requisite","course": "PHYSICS 1C"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C111",
        "title": "Machine Learning and Artificial Intelligence for Civil Engineering",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: course M20, Chemistry 20A, 20B, Mathematics 31A, 31B, 32B, Physics 1A, 1B, 1C. Theoretical and practical introduction to artificial intelligence and machine learning for civil engineering problems. Focus on practice and problem-solving skills. By course end, students are expected to be able to independently run machine learning analysis. Concurrently scheduled with course C211. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE M20"},
            {"type": "requisite","course": "CHEM 20A"},
            {"type": "requisite","course": "CHEM 20B"},
            {"type": "requisite","course": "MATH 31A"},
            {"type": "requisite","course": "MATH 31B"},
            {"type": "requisite","course": "MATH 32B"},
            {"type": "requisite","course": "PHYSICS 1A"},
            {"type": "requisite","course": "PHYSICS 1B"},
            {"type": "requisite","course": "PHYSICS 1C"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C128",
        "title": "Geohazards and Infrastructure Resilience",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 120. Geologic characterization of soil and rock units. Relationships developed between landforms, active, past, and ancient geologic processes, ground and surface water, and properties of soil and rock. Geohazards associated with climate change, wildfires, landslides, volcanism, and earthquakes. Effects of geologic processes on civil infrastructure and risk assessment procedures to promote resilience. Concurrently scheduled with course C228. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 120"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C158",
        "title": "Coastal Engineering",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 107 or Mechanical and Aerospace Engineering 103, 151. Covers coastal water levels (tides, climate variability, storms, sea level rise, resonance), surface gravity waves (characteristics, transformation, spectra), coastal processes (overtopping, erosion, flooding), coastal protection (walls, nourishment, dunes, berms, nature-based infrastructure), coastal modeling. Concurrently scheduled with course C258. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 107"},{"type": "requisite","course": "MECH&AE 103"}]},
            {"type": "requisite","course": "C&EE 151"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C159",
        "title": "Green Infrastructure",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 150, 153. Overview of fundamental science, engineering, and ecological principles to designing green infrastructure for stormwater management. Students design green infrastructure based on current practices, perform engineering calculations to calculate its performance, and develop critical thinking skills needed to design innovative or futuristic green infrastructures that would not only mitigate adverse impact of climate change, but also remain resilient under extreme weather conditions expected during climate change. Concurrently scheduled with course C259. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 150"},
            {"type": "requisite","course": "C&EE 153"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C164",
        "title": "Sustainable Waste Management",
        "units": 4,
        "description": "(Formerly numbered 164.) Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 153. Introduction to environmental engineering. Management of solid wastes, some of which are hazardous, is integral part of infrastructure development, and it is required to achieve environmental sustainability. Study of all aspects of hazardous and municipal solid waste management technologies with particular emphasis on reuse of some wastes for alternative applications or energy production. Students are expected to integrate economic, environmental, regulatory, policy, and technical considerations into development of engineering designs of sustainable waste management. Student teams design sustainable remediation or waste management plans. Concurrently scheduled with course C264. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 153"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C181",
        "title": "Traffic Engineering Systems: Operations and Control",
        "units": 4,
        "description": "(Formerly numbered 181.) Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 180. Traffic operations including traffic data collection and analysis, safety and crash studies, traffic flow theory, highway capacity analysis, signalized intersection design and analysis, and simulation modeling. Students gain understanding of basic traffic flow theory, learn to conduct traffic data collection and analysis, and to apply capacity analysis methods and simulation modeling for both highway and signalized intersections. Concurrently scheduled with course C281. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 180"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C182",
        "title": "Rigid and Flexible Pavements: Design, Materials, and Serviceability",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Recommended requisites: courses C104, 108, 120, Materials Science 104. Correlation, analysis, and metrication of aspects of pavement design, including materials selection and traffic loading and volume. Special attention to aspects of pavement distress/serviceability and factoring of these into metrics of pavement performance. Discussion of potential choices of pavement materials (i.e., asphalt and concrete) and their specific strengths and weaknesses in paving applications. Unification and correlation of different variables that influence pavement performance and highlight their relevance in pavement design. Concurrently scheduled with course C282. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C183",
        "title": "Transportation Sustainability",
        "units": 4,
        "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Evaluation of urban transportation design policies and practices for addressing sustainable transportation. Examination of historical and contemporary role engineers have played in planning and design of urban transportation systems. Exploration and critical analysis of emerging transportation technologies and policy strategies in improving mobility and reducing air pollution and greenhouse gas emissions. Consideration of how to incorporate social justice principles to create more sustainable and equitable transportation system. May be repeated once for credit. Concurrently scheduled with course C283. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C184",
        "title": "Transportation System and Policy Outcomes",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Introduction to the measurement of equity outcomes within the context of transportation infrastructure investment and policies. Students learn to understand the data, models, and metrics used to evaluate the fine-grained impacts of transportation systems and policies on people. Examination of how these impacts can be distributed across people, according to spatial and demographic characteristics. Students gain experience and learn how standard and emerging equity measures can be calculated and interpreted, as well as learn from critiquing the state of practice on transportation equity measurement. May be repeated once for credit. Concurrently scheduled with course C284. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C185",
        "title": "Transportation Systems Analysis",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 180. Transportation researchers and practitioners are motivated by desire to explain spatial interactions that resulted in movement of people or goods from place to place. Such interactions become more intricate as new technologies emerge. To explore and perceive these intricate interactions, understanding of essential nature of transportation systems to analyze and optimally design such systems is needed more than ever. Introduction to fundamental concepts, methods, and principles underlying transportation systems analysis. Includes two modules, each of which focuses on one level of system analysis: traveler behavior and network. Concurrently scheduled with course C285. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 180"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C186",
        "title": "Intelligent Transportation Systems",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 180. Introduction to basic elements of intelligent transportation systems (ITS), focusing on technological, systems, and institutional aspects. Topics include systems engineering processes, advanced traveler information systems, transportation network operations, commercial vehicle operations and intermodal freight, public transportation applications, ITS and regional strategic transportation planning, travel demand management, electronic toll collection, and road-pricing, connected and automated vehicles (CAV), data access and exchanges, cybersecurity for ITS, and other smart mobility technologies. Concurrently scheduled with course C286. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 180"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C204",
        "title": "Structure, Processing, and Properties of Civil Engineering Materials",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Discussion of aspects of cement and concrete materials, including manufacture of cement and production of concrete. Aspects of cement composition and basic chemical reactions, microstructure, properties of plastic and hardened concrete, chemical admixtures, and quality control and acceptance testing. Development and testing of fundamentals for complete understanding of overall response of all civil engineering materials. By end of term, successful utilization of fundamental materials science concepts to understand, explain, analyze, and describe engineering performance of civil engineering materials. Concurrently scheduled with course C104. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C205",
        "title": "Structure and Properties of Amorphous Civil Engineering Materials",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: course 91 or Mechanical and Aerospace Engineering 101, Chemistry 20A, 20B, Mathematics 31A, 31B, 32B, Physics 1A, 1B, 1C. Corequisite: course 108. Nature and properties of amorphous civil engineering materials in fields of infrastructure and technology. Special attention to composition-structure-properties relationships and design and selection with respect to targeted civil engineering applications. Concurrently scheduled with course C105. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 91"},{"type": "requisite","course": "MECH&AE 101"}]},
            {"type": "requisite","course": "CHEM 20A"},
            {"type": "requisite","course": "CHEM 20B"},
            {"type": "requisite","course": "MATH 31A"},
            {"type": "requisite","course": "MATH 31B"},
            {"type": "requisite","course": "MATH 32B"},
            {"type": "requisite","course": "PHYSICS 1A"},
            {"type": "requisite","course": "PHYSICS 1B"},
            {"type": "requisite","course": "PHYSICS 1C"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C206",
        "title": "Modeling and Simulation of Civil Engineering Materials",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisites: Chemistry and Biochemistry 20A, 20B, Mathematics 31A, 31B, 32B, Physics 1A, 1B, 1C. Provides fundamental understanding of modeling and numerical simulations for civil engineering materials. Largely focused on practical examples and applications. By course end, students are expected to be able to independently run simulations at scale relevant to targeted problems. Concurrently scheduled with course C106. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "CHEM 20A"},
            {"type": "requisite","course": "CHEM 20B"},
            {"type": "requisite","course": "MATH 31A"},
            {"type": "requisite","course": "MATH 31B"},
            {"type": "requisite","course": "MATH 32B"},
            {"type": "requisite","course": "PHYSICS 1A"},
            {"type": "requisite","course": "PHYSICS 1B"},
            {"type": "requisite","course": "PHYSICS 1C"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C211",
        "title": "Machine Learning and Artificial Intelligence for Civil Engineering",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Theoretical and practical introduction to artificial intelligence and machine learning for civil engineering problems. Focus on practice and problem-solving skills. By course end, students are expected to be able to independently run machine learning analysis. Concurrently scheduled with course C111. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C228",
        "title": "Geohazards and Infrastructure Resilience",
        "units": 4,
        "description": "Lecture, four hours; outside study, eight hours. Requisite: course 120. Geologic characterization of soil and rock units. Relationships developed between landforms, active, past, and ancient geologic processes, ground and surface water, and properties of soil and rock. Geohazards associated with climate change, wildfires, landslides, volcanism, and earthquakes. Effects of geologic processes on civil infrastructure and risk assessment procedures to promote resilience. Concurrently scheduled with course C128. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 120"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C258",
        "title": "Coastal Engineering",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 107 or Mechanical and Aerospace Engineering 103, 151. Covers coastal water levels (tides, climate variability, storms, sea level rise, resonance), surface gravity waves (characteristics, transformation, spectra), coastal processes (overtopping, erosion, flooding), coastal protection (walls, nourishment, dunes, berms, nature-based infrastructure), coastal modeling. Concurrently scheduled with course C158. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 107"},{"type": "requisite","course": "MECH&AE 103"}]},
            {"type": "requisite","course": "C&EE 151"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C259",
        "title": "Green Infrastructure",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 150, 153. Overview of fundamental science, engineering, and ecological principles to designing green infrastructure for stormwater management. Students design green infrastructure based on current practices, perform engineering calculations to calculate its performance, and develop critical thinking skills needed to design innovative or futuristic green infrastructures that would not only mitigate adverse impact of climate change, but also remain resilient under extreme weather conditions expected during climate change. Concurrently scheduled with course C159. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 150"},
            {"type": "requisite","course": "C&EE 153"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C264",
        "title": "Sustainable Waste Management",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Introduction to environmental engineering. Management of solid wastes, some of which are hazardous, is integral part of infrastructure development, and it is required to achieve environmental sustainability. Study of all aspects of hazardous and municipal solid waste management technologies with particular emphasis on reuse of some wastes for alternative applications or energy production. Students are expected to integrate economic, environmental, regulatory, policy, and technical considerations into development of engineering designs of sustainable waste management. Student teams design sustainable remediation or waste management plans. Concurrently scheduled with course C164. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C281",
        "title": "Traffic Engineering Systems: Operations and Control",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 180. Traffic operations including traffic data collection and analysis, safety and crash studies, traffic flow theory, highway capacity analysis, signalized intersection design and analysis, and simulation modeling. Students gain understanding of basic traffic flow theory, learn to conduct traffic data collection and analysis, and to apply capacity analysis methods and simulation modeling for both highway and signalized intersections. Concurrently scheduled with course C181. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 180"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C282",
        "title": "Rigid and Flexible Pavements: Design, Materials, and Serviceability",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Correlation, analysis, and metrication of aspects of pavement design, including materials selection and traffic loading and volume. Special attention to aspects of pavement distress/serviceability and factoring of these into metrics of pavement performance. Discussion of potential choices of pavement materials (i.e., asphalt and concrete) and their specific strengths and weaknesses in paving applications. Unification and correlation of different variables that influence pavement performance and highlight their relevance in pavement design. Concurrently scheduled with course C182. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C283",
        "title": "Transportation Sustainability",
        "units": 4,
        "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Evaluation of urban transportation design policies and practices for addressing sustainable transportation. Examination of historical and contemporary role engineers have played in planning and design of urban transportation systems. Exploration and critical analysis of emerging transportation technologies and policy strategies in improving mobility and reducing air pollution and greenhouse gas emissions. Consideration of how to incorporate social justice principles to create more sustainable and equitable transportation system. May be repeated once for credit. Concurrently scheduled with course C183. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C283",
        "title": "Transportation Sustainability",
        "units": 4,
        "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Evaluation of urban transportation design policies and practices for addressing sustainable transportation. Examination of historical and contemporary role engineers have played in planning and design of urban transportation systems. Exploration and critical analysis of emerging transportation technologies and policy strategies in improving mobility and reducing air pollution and greenhouse gas emissions. Consideration of how to incorporate social justice principles to create more sustainable and equitable transportation system. May be repeated once for credit. Concurrently scheduled with course C183. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C284",
        "title": "Transportation System and Policy Outcomes",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Introduction to the measurement of equity outcomes within the context of transportation infrastructure investment and policies. Students learn to understand the data, models, and metrics used to evaluate the fine-grained impacts of transportation systems and policies on people. Examination of how these impacts can be distributed across people, according to spatial and demographic characteristics. Students gain experience and learn how standard and emerging equity measures can be calculated and interpreted, as well as learn from critiquing the state of practice on transportation equity measurement. May be repeated once for credit. Concurrently scheduled with course C184. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C284",
        "title": "Transportation System and Policy Outcomes",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Introduction to the measurement of equity outcomes within the context of transportation infrastructure investment and policies. Students learn to understand the data, models, and metrics used to evaluate the fine-grained impacts of transportation systems and policies on people. Examination of how these impacts can be distributed across people, according to spatial and demographic characteristics. Students gain experience and learn how standard and emerging equity measures can be calculated and interpreted, as well as learn from critiquing the state of practice on transportation equity measurement. May be repeated once for credit. Concurrently scheduled with course C184. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C285",
        "title": "Transportation Systems Analysis",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 180. Transportation researchers and practitioners are motivated by desire to explain spatial interactions that resulted in movement of people or goods from place to place. Such interactions become more intricate as new technologies emerge. To explore and perceive these intricate interactions, understanding of essential nature of transportation systems to analyze and optimally design such systems is needed more than ever. Introduction to fundamental concepts, methods, and principles underlying transportation systems analysis. Includes two modules, each of which focuses on one level of system analysis: traveler behavior and network. Concurrently scheduled with course C185. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 180"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C285",
        "title": "Transportation Systems Analysis",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 180. Transportation researchers and practitioners are motivated by desire to explain spatial interactions that resulted in movement of people or goods from place to place. Such interactions become more intricate as new technologies emerge. To explore and perceive these intricate interactions, understanding of essential nature of transportation systems to analyze and optimally design such systems is needed more than ever. Introduction to fundamental concepts, methods, and principles underlying transportation systems analysis. Includes two modules, each of which focuses on one level of system analysis: traveler behavior and network. Concurrently scheduled with course C185. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 180"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C286",
        "title": "Intelligent Transportation Systems",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 180. Introduction to basic elements of intelligent transportation systems (ITS), focusing on technological, systems, and institutional aspects. Topics include systems engineering processes, advanced traveler information systems, transportation network operations, commercial vehicle operations and intermodal freight, public transportation applications, ITS and regional strategic transportation planning, travel demand management, electronic toll collection, and road-pricing, connected and automated vehicles (CAV), data access and exchanges, cybersecurity for ITS, and other smart mobility technologies. Concurrently scheduled with course C186. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 180"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE C286",
        "title": "Intelligent Transportation Systems",
        "units": 4,
        "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: course 180. Introduction to basic elements of intelligent transportation systems (ITS), focusing on technological, systems, and institutional aspects. Topics include systems engineering processes, advanced traveler information systems, transportation network operations, commercial vehicle operations and intermodal freight, public transportation applications, ITS and regional strategic transportation planning, travel demand management, electronic toll collection, and road-pricing, connected and automated vehicles (CAV), data access and exchanges, cybersecurity for ITS, and other smart mobility technologies. Concurrently scheduled with course C186. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE 180"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE M135C",
        "title": "Introduction to Finite Element Methods",
        "units": 4,
        "description": "(Same as Mechanical and Aerospace Engineering M168.) Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 130 or Mechanical and Aerospace Engineering 156A or 166A. Introduction to basic concepts of finite element methods (FEM) and applications to structural and solid mechanics and heat transfer. Direct matrix structural analysis; weighted residual, least squares, and Ritz approximation methods; shape functions; convergence properties; isoparametric formulation of multidimensional heat flow and elasticity; numerical integration. Practical use of FEM software; geometric and analytical modeling; preprocessing and postprocessing techniques; term projects with computers. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 130"},{"type": "requisite","course": "MECH&AE 156A"},{"type": "requisite","course": "MECH&AE 166A"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE M135C",
        "title": "Introduction to Finite Element Methods",
        "units": 4,
        "description": "(Same as Mechanical and Aerospace Engineering M168.) Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 130 or Mechanical and Aerospace Engineering 156A or 166A. Introduction to basic concepts of finite element methods (FEM) and applications to structural and solid mechanics and heat transfer. Direct matrix structural analysis; weighted residual, least squares, and Ritz approximation methods; shape functions; convergence properties; isoparametric formulation of multidimensional heat flow and elasticity; numerical integration. Practical use of FEM software; geometric and analytical modeling; preprocessing and postprocessing techniques; term projects with computers. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 130"},{"type": "requisite","course": "MECH&AE 156A"},{"type": "requisite","course": "MECH&AE 166A"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE M165",
        "title": "Environmental Nanotechnology: Implications and Applications",
        "units": 4,
        "description": "(Same as Engineering M103.) Lecture, four hours; discussion, two hours; outside study, six hours. Recommended requisite: Engineering M101. Introduction to potential implications of nanotechnology to environmental systems as well as potential application of nanotechnology to environmental protection. Technical contents include three multidisciplinary areas: (1) physical, chemical, and biological properties of nanomaterials, (2) transport, reactivity, and toxicity of nanoscale materials in natural environmental systems, and (3) use of nanotechnology for energy and water production, plus environmental protection, monitoring, and remediation. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE M166",
        "title": "Environmental Microbiology",
        "units": 4,
        "description": "(Same as Environmental Health Sciences M166.) Lecture, four hours; discussion, two hours; outside study, six hours. Recommended requisite: course 153. Microbial cell and its metabolic capabilities, microbial genetics and its potentials, growth of microbes and kinetics of growth, microbial ecology and diversity, microbiology of wastewater treatment, probing of microbes, public health microbiology, pathogen control. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE M166L",
        "title": "Environmental Microbiology Laboratory",
        "units": 2,
        "description": "(Same as Environmental Health Sciences M166L.) Lecture, one hour; laboratory, two hours; outside study, two hours. Requisite: course M166 (may be taken concurrently). General laboratory practice within environmental microbiology, sampling of environmental samples, classical and modern molecular techniques for enumeration of microbes from environmental samples, techniques for determination of microbial activity in environmental samples, laboratory setups for studying environmental biotechnology. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE M20",
        "title": "Introduction to Computer Programming with MATLAB",
        "units": 4,
        "description": "(Same as Mechanical and Aerospace Engineering M20.) Lecture, two hours; discussion, two hours; laboratory, two hours; outside study, six hours. Requisite: Mathematics 33A. Fundamentals of computer programming taught in context of MATLAB computing environment. Basic data types and control structures. Input/output. Functions. Data visualization. MATLAB-based data structures. Development of efficient codes. Introduction to object-oriented programming. Examples and exercises from engineering, mathematics, and physical sciences. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "MATH 33A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE M230A",
        "title": "Linear Elasticity",
        "units": 4,
        "description": "(Same as Mechanical and Aerospace Engineering M256A.) Lecture, four hours; outside study, eight hours. Requisite: Mechanical and Aerospace Engineering 156A or 166A. Linear elastostatics. Cartesian tensors; infinitesimal strain tensor; Cauchy stress tensor; strain energy; equilibrium equations; linear constitutive relations; plane elastostatic problems, holes, corners, inclusions, cracks; three-dimensional problems of Kelvin, Boussinesq, and Cerruti. Introduction to boundary integral equation method. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "MECH&AE 156A"},{"type": "requisite","course": "MECH&AE 166A"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE M230B",
        "title": "Nonlinear Elasticity",
        "units": 4,
        "description": "(Same as Mechanical and Aerospace Engineering M256B.) Lecture, four hours; outside study, eight hours. Requisite: course M230A. Kinematics of deformation, material and spatial coordinates, deformation gradient tensor, nonlinear and linear strain tensors, strain displacement relations; balance laws, Cauchy and Piola stresses, Cauchy equations of motion, balance of energy, stored energy; constitutive relations, elasticity, hyperelasticity, thermoelasticity; linearization of field equations; solution of selected problems. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE M230A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE M230C",
        "title": "Plasticity",
        "units": 4,
        "description": "(Same as Mechanical and Aerospace Engineering M256C.) Lecture, four hours; outside study, eight hours. Requisites: courses M230A, M230B. Classical rate-independent plasticity theory, yield functions, flow rules and thermodynamics. Classical rate-dependent viscoplasticity, Perzyna and Duvant/Lions types of viscoplasticity. Thermoplasticity and creep. Return mapping algorithms for plasticity and viscoplasticity. Finite element implementations. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "C&EE M230A"},
            {"type": "requisite","course": "C&EE M230B"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE M237A",
        "title": "Dynamics of Structures",
        "units": 4,
        "description": "(Same as Mechanical and Aerospace Engineering M269A.) Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: courses 135A, C137, or equivalent. Principles of dynamics. Determination of normal modes and frequencies by differential and integral equation solutions. Transient and steady-state response. Emphasis on derivation and solution of governing equations using matrix formulation. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "C&EE 135A"},{"type": "requisite","course": "C&EE C137"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE M262A",
        "title": "Introduction to Atmospheric Chemistry",
        "units": 4,
        "description": "(Same as Atmospheric and Oceanic Sciences M203A.) Lecture, three hours. Requisite for undergraduates: Chemistry 20B. Principles of chemical kinetics, thermochemistry, spectroscopy, and photochemistry; chemical composition and history of Earth's atmosphere; biogeochemical cycles of key atmospheric constituents; basic photochemistry of troposphere and stratosphere, upper atmosphere chemical processes; air pollution; chemistry and climate. S/U or letter grading.",
        "requisites": [
            {"type": "requisite","course": "CHEM 20B"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE M262B",
        "title": "Atmospheric Diffusion and Air Pollution",
        "units": 4,
        "description": "(Same as Atmospheric and Oceanic Sciences M224B.) Lecture, three hours. Nature and sources of atmospheric pollution; diffusion from point, line, and area sources; pollution dispersion in urban complexes; meteorological factors and air pollution potential; meteorological aspects of air pollution. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "C&EE M287",
        "title": "Travel Behavior Analysis",
        "units": 4,
        "description": "(Same as Public Policy M221 and Urban Planning M253.) Lecture, three hours. Requisites: Public Policy 201 or M201A, and 203, or Urban Planning 207 and 220B. Descriptions of travel patterns in metropolitan areas, recent trends and projections into future, overview of travel forecasting methods, trip generation, trip distribution, mode split traffic assignment, critique of traditional travel forecasting methods and new approaches to travel behavior analysis. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "group","needs": 2,"options": [{"type": "group","needs": 1,"options": [{"type": "requisite","course": "PUB PLC 201"},{"type": "requisite","course": "PUB PLC M201A"}]},{"type": "requisite","course": "PUB PLC 203"}]},{"type": "group","needs": 2,"options": [{"type": "requisite","course": "URBN PL 207"},{"type": "requisite","course": "URBN PL 220B"}]}]}
        ],
        "equivalentCourses": []
    }
]
