[
  {
    "id": "COMM 1",
    "title": "Principles of Oral Communication",
    "units": 4,
    "description": "Lecture, four hours. Enforced requisite: satisfaction of Entry-Level Writing requirement. Examination of foundations of communication and public speaking. Consideration of number of basic theories related to study of communication and development of skills to enable composition and delivery of speeches in accordance with specific rhetorical concepts. Improvement of ability to analyze, organize, and critically think about communicative messages while becoming better equipped to articulate ideas. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 10",
    "title": "Introduction to Communication",
    "units": 5,
    "description": "Lecture, four hours; discussion, one hour. Introduction to study of interpersonal and mass communication using interdisciplinary approach. Exploration of basic methods and theoretical perspectives that social scientists and others use to study interpersonal and mass communication, and basic concepts used to describe and explain that communication. Historical overview of each major mass media. Study of significant current topical issues related to means of communication that reach large numbers of people. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 100",
    "title": "Communication Science",
    "units": 4,
    "description": "Lecture, three hours. Requisite: course 10 or Linguistics 1 or Sociology 1 or Psychology 10. Examination of fundamental issues in communication sciences. Exploration of theoretical and methodological approaches that bridge major areas of current interdisciplinary communication research. P/NP or letter grading.",
    "requisites": [
      {
        "type": "group",
        "needs": 1,
        "options": [
          {
            "type": "requisite",
            "course": "COMM 10"
          },
          {
            "type": "requisite",
            "course": "LING 1"
          },
          {
            "type": "requisite",
            "course": "SOCIOL 1"
          },
          {
            "type": "requisite",
            "course": "PSYCH 10"
          }
        ]
      }
    ],
    "equivalentCourses": []
  },
  {
    "id": "COMM 101",
    "title": "Freedom of Communication",
    "units": 4,
    "description": "Lecture, four hours. Analysis of legal, political, and philosophical issues entailed in rights of free expression, access to audience, and access to information. Study of court decisions governing freedom of communication in U.S. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 102",
    "title": "Principles of Argumentation",
    "units": 4,
    "description": "Lecture, four hours. Analysis of propositions, tests of evidence, briefing. Study of hindrances to clear thinking, ambiguity of terms, and prejudices. Critical analysis of selected argumentative speeches. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 104",
    "title": "Rumors, Gossip, and Urban Legends in Journalism",
    "units": 4,
    "description": "Three hours. Study of the creative relationship between fact and fiction by using-through examples from 20th-century journalism-three distinct types of communication: rumor, gossip, and urban legend. Broadly speaking, rumor mimics news and is unverified communication about events. Gossip is reputation management disguised as lighthearted chitchat. Urban legends mimic documentary-type news while their actual function is to teach about hidden dangers lurking behind the apparently normal surface of reality. All three belong to the category of informal communication, also known as hearsay. Since mimicry and disguise are the main way rumor, gossip, and urban legends appear credibly factual, study provides students with analytic tools to identify then analyze these distinct but widespread types of communication. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 105",
    "title": "Media Conspiracy Theories in U.S. and Middle East",
    "units": 4,
    "description": "Lecture, three hours. Through mass and digital media, conspiracy theories are reshaping politics and society around world. Although conspiracy theories are globally widespread, they find particularly fertile ground in Middle East and in U.S. Definition, identification, and analysis of conspiracy theories as they appear in media of Western democracies and Muslim majority societies. Interdisciplinary approach to study of conspiracy theories. Case studies, such as conspiracies about 9/11, taken from Middle Eastern media sources in English translation. Background knowledge of Middle East not required. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 106",
    "title": "Reporting America",
    "units": 4,
    "description": "Lecture, three hours. Introduction to main western European and Middle Eastern news media, with materials in English. Exploration of how U.S. is represented in Europe, Middle East, Iran, and Afghanistan, with focus on three comparative case studies of Britain, Spain, and Germany. In-depth coverage of American news as reflected in Europe and Middle East. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 107",
    "title": "Terrorism in Journalism",
    "units": 4,
    "description": "Lecture, three hours. How do media outlets in Middle East represent Islamist terrorism? How do they describe, analyze, and comment on suicide attacks? Focus on Arab, Afghan, and Iranian media discussions of this phenomenon to explore evolution of meaning of terrorism in Muslim societies. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 108",
    "title": "Communication and Identity",
    "units": 4,
    "description": "Lecture, three hours. Study of relationships among communication, culture, and identity, and examination of ways in which texts (broadly construed) constitute experience, difference, and subjectivity. Focus on function of language, representation and meaning in construction of self, social collectives, and world views. Consideration of how communication is performative endeavor for humans seeking to construct identity. Students are prepared to describe and explain theories that detail performance as communicative form, analyze ways language and discourse function as texts that work to produce significant personal and social identities, and describe specific principles, motivations, and theoretical categories within interdisciplinary study of culture that produce identity. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 109",
    "title": "Entrepreneurial Communication",
    "units": 4,
    "description": "Lecture, four hours. Study of entrepreneurial communication from foundations in internal and external communication and development of data analysis, interpretation, and presentational skills utilized in existing, as well as in development of, contemporary innovative businesses. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 110",
    "title": "Gender and Communication",
    "units": 4,
    "description": "Lecture, four hours. Understanding gender is fundamental part of understanding who we are as human beings. Exploration of crucial role of gender in spheres of life involving communication and role and origins of gender differences in communication. Contexts of communication include family, workplace, sexuality, and intimate relationships. Discussion of how media influence conceptions of gender. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 111",
    "title": "Conflict and Communication",
    "units": 4,
    "description": "Lecture, three hours. Analysis of when and why conflict is prevalent in daily lives (including mass media) and how communication affects reactions to and consequences of conflict. Conflict is part of our evolutionary heritage. How well we handle various conflicts affects, to great degree, our success or failure wherever we interact with others, including intimate relations, school, and workplace. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 114",
    "title": "Understanding Relationships",
    "units": 4,
    "description": "Lecture, four hours. Explanation of types of communication that occur in close relationships, especially romantic relationships. In-depth coverage of variety of relationship topics, including intimacy, stages of intimate relationships, why we choose to get involved with some people as opposed to others, flirting, and self-disclosure. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 115",
    "title": "Interpersonal Dynamics",
    "units": 4,
    "description": "Lecture, three hours. Survey of recent scientific approaches to dyadic communication and relationships. Surveys selection of experimental, observational, and quantitative methods, and how they can be applied to key issues in dyadic communication and interpersonal relationships. Topics include recent technological techniques for measuring and influencing dyads, including role of peripheral devices such as phones or other wearable devices. Consideration of dyadic processes including influence, mimicry, leadership, active listening, and more. Consideration also of how findings apply beyond dyads to teams. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 118",
    "title": "Language and Music",
    "units": 4,
    "description": "Lecture, three hours. Cognitive science exploration of structure and evolution of language and music and their relationships to communication, cognition, and culture. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 119",
    "title": "Voice and Its Perception",
    "units": 4,
    "description": "Lecture, four hours. Focus on how human voice conveys information about identity of speakers, physical characteristics, personality, and emotional state, and on how listeners utilize this information to make judgments about speakers. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 120",
    "title": "Group Communication",
    "units": 4,
    "description": "Lecture, four hours. Examination of group communication from perspectives of evolutionary psychology, communications, and psycholinguistics. Topics include evolution of cooperation, ingroup and outgroup dynamics, gossip, music improvisation, and conversational behavior. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 121",
    "title": "Communication Development",
    "units": 4,
    "description": "Lecture, three hours. Topics in childhood development of human interpersonal communication, including production and perception of communicative signals at different ages, methods for studying communication development, physiological and social mechanisms, cross-cultural similarities and differences in communication development, effects of media and technology, and disorders. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 122",
    "title": "Visual Communication",
    "units": 4,
    "description": "Lecture, three hours; discussion, one hour. Exploration of visual basis of communication through study of social minds of infants, adults, and nonhuman primates. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 126",
    "title": "Evolution of Interpersonal Communication",
    "units": 4,
    "description": "Lecture, four hours. Examination of current issues in interpersonal communication from perspectives of evolutionary psychology and biology. Topics include coevolution of signaler and receiver adaptations, nonverbal communication, courtship behavior, miscommunication between sexes, implied language use, and deception. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 130",
    "title": "Science of Language",
    "units": 4,
    "description": "Lecture, three hours. Introduction to scientific foundations of psycholinguistics, and connections to applied issues in communication. Survey of various scientific methods, and how they are applied to key issues in language and communication. Discussion of how we can measure meanings of words, complexity of sentences, and study of how these are processed (and produced) during communication. Includes some hands-on exercises, including learning some scientific tools that can be used both in future research and in field. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 131",
    "title": "Computer Models of Communicators",
    "units": 4,
    "description": "Lecture, three hours. Introduction to using computerized methods to model communication processes. Survey of various computational methods, and how to apply these in hands-on exercises. Exercises help setup small-scale simulations of communicators on personal computers. Covers computer models for individual communicators, dyads, groups, and collective (mass) systems. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 132",
    "title": "Multicultural Television",
    "units": 4,
    "description": "Lecture, four hours. Critical evaluation of television programming and scholarly research of new developments in television. Application of research findings by students to real-world contexts in course discussions, papers, and presentations. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 140",
    "title": "Theory of Persuasive Communication",
    "units": 4,
    "description": "Lecture, four hours. Dynamics of communication designed to influence human conduct; analysis of structure of persuasive discourse; integration of theoretical materials from relevant disciplines of humanities and social sciences. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 141",
    "title": "Films of Persuasion: Social and Political Advocacy in Mass Society",
    "units": 4,
    "description": "Lecture, three hours; discussion, one hour. Films often provide commentary about public issues. Examination of how films communicate to large audiences about history, society, and politics. Critical evaluation of these works to understand power and limitations of films as social persuasion. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 143",
    "title": "Rhetoric of Popular Culture",
    "units": 4,
    "description": "Lecture, three hours. Rhetorical approach to study of U.S. popular culture. Examination, both at theoretical level and through specific case studies, of ways in which popular cultural texts perform rhetorically to influence political and social struggles shaping everyday life. How do particular artifacts or communicative texts constitute source for (re)negotiation of cultural meanings as well as greater understanding of ways language functions as vehicle for human action. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 145",
    "title": "Television Sitcom and American Culture",
    "units": 4,
    "description": "Lecture, three hours. Historical analysis of sitcom genre from its beginning in late 1940s to present. Investigation of how sitcoms have influenced American life and culture and how American life and culture have influenced sitcoms. Exploration of issues of family, race and ethnicity, class and economy, gender roles, and political culture. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 146",
    "title": "Evolution of Mass Media Images",
    "units": 5,
    "description": "Lecture, four hours; discussion/laboratory, one hour. Analysis of evolutionary psychology as basis for images selected by media portraying women and/or minorities in entertainment, advertising, and informational communication. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 148",
    "title": "Marketing Communications",
    "units": 4,
    "description": "Lecture, three hours. Examination of key concepts and methods in marketing communications in both traditional and digital media. Development and execution of communications strategies, with primary emphasis on consumer insight, branding, market segmentation and positioning, message strategy, promotion, and execution of marketing communications through appropriate media technologies. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 150",
    "title": "Methodologies in Communication Research",
    "units": 5,
    "description": "Lecture, four hours; discussion, one hour. Requisite: Economics 41 or Statistics 10. Limited to Communication majors. Examination of quantitative and qualitative methodologies in communication research. Letter grading.",
    "requisites": [
      {
        "type": "group",
        "needs": 1,
        "options": [
          {
            "type": "requisite",
            "course": "ECON 41"
          },
          {
            "type": "requisite",
            "course": "STATS 10"
          }
        ]
      }
    ],
    "equivalentCourses": []
  },
  {
    "id": "COMM 151",
    "title": "Computer-Mediated Communication",
    "units": 4,
    "description": "Lecture, four hours. Examination of how computer technology, particularly Internet, has influenced patterns of human communication. History and distinctiveness of computer-mediated communication (CMC). CMC's influence on modern economic, political, and social interaction. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 152",
    "title": "Analysis of Communication Effects",
    "units": 4,
    "description": "Lecture, four hours. Survey of experimental and field research on effects of communications. Study of source, message, and environmental factors affecting audience response. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 153",
    "title": "Introduction to Data Science",
    "units": 4,
    "description": "Lecture, three hours. Requisite: one course from Computer Science 31, 32, Program in Computing 10A, 10B with grade of C&plus; or better, or equivalent. Examination of how large-scale data can be used to systematically measure various aspects of human activities. Review of series of computational and statistical methods which enable scalable analysis and cost reduction. Students learn to interpret and understand research findings and implications from published work. Review of ethical issues in data science, such as privacy and model biases. Investigation of limitations and risks of current methods. Discussion of various ways to improve transparency and accountability of data-driven research. Letter grading.",
    "requisites": [
      {
        "type": "group",
        "needs": 1,
        "options": [
          {
            "type": "requisite",
            "course": "COM SCI 31"
          },
          {
            "type": "requisite",
            "course": "COM SCI 32"
          },
          {
            "type": "requisite",
            "course": "COMPTNG 10A"
          },
          {
            "type": "requisite",
            "course": "COMPTNG 10B"
          }
        ]
      }
    ],
    "equivalentCourses": []
  },
  {
    "id": "COMM 155",
    "title": "Artificial Intelligence and New Media",
    "units": 4,
    "description": "Lecture, three hours; discussion, one hour. Requisite: Computer Science 31 or 32 or Program in Computing 10A or 10B with grade of C&plus; or better. Artificial intelligence (AI) and machine learning (ML) have made rapid progress in recent years on various fronts. Many of their advanced techniques are being transferred to number of domains such as business, transportation, medicine, advertisement, military operations, and social media, and aiding our decision making, planning, reasoning, and forecasting. Review of origin and modern development of artificial intelligence and its recent breakthroughs through many applications with special emphasis on its usages of media industry, e.g., personalization, recommendation, and targeted advertising. Covers its technical merits as well as controversies such as ethical and moral issues of AI, privacy concerns in data collection, and fair use of AI in general. Prior knowledge in mathematics, statistics, or computer science not required. Discussion of elementary technical details as course unfolds. Letter grading.",
    "requisites": [
      {
        "type": "group",
        "needs": 1,
        "options": [
          {
            "type": "requisite",
            "course": "COM SCI 31"
          },
          {
            "type": "requisite",
            "course": "COM SCI 32"
          },
          {
            "type": "requisite",
            "course": "COMPTNG 10A"
          },
          {
            "type": "requisite",
            "course": "COMPTNG 10B"
          }
        ]
      }
    ],
    "equivalentCourses": []
  },
  {
    "id": "COMM 156",
    "title": "Social Networking",
    "units": 4,
    "description": "Lecture, three hours. Investigation of how new online social networks have facilitated interpersonal interactions for knowledge sharing, romance, business, politics, and entertainment. Critical investigation of current popular social networking websites (e.g., Facebook, Twitter, YouTube) through social network analysis and other social science research methods. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 157",
    "title": "Celebrity, Fame, and Social Media",
    "units": 4,
    "description": "Lecture, three hours. Analysis of how following personal lives of media-created celebrities impacts self-esteem, connectedness, and personal relationships from cultural studies and social sciences perspectives, and how entities cultivate celebrity for financial gain. Topics include celebrity gossip and privacy, news sharing, public relations, and impact of social media on fan support, image construction, and damage control. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 158",
    "title": "Python for Social Sciences",
    "units": 4,
    "description": "Lecture, two and one half hours; discussion, one hour. Beginner-friendly inquiry into the practical applications of Python in social sciences. Ideal for processing large datasets and automating tasks, Python's versatility extends to visualization and artificial intelligence. Students learn the basics of Python coding, and focus on the essential Pandas library for data analysis. Study adopts a project-oriented approach, allowing direct application of skills in social science scenarios. Exploration additionally of use of ChatGPT to accelerate coding learning process. May be repeated once for credit. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 159",
    "title": "Artificial Intelligence and Society",
    "units": 4,
    "description": "Lecture, three hours. Impact of artificial intelligence (AI) on society is growing rapidly. Exploration of questions of what if superhuman AI is achieved, will it free humans from tedious jobs or cause mass unemployment, and how to guarantee AI safety so that it will not annihilate human civilization. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 160",
    "title": "Political Communication",
    "units": 4,
    "description": "Lecture, four hours; discussion, one hour. Study of nature and function of communication in political sphere; analysis of contemporary and historical communications within established political institutions; state papers; deliberative discourses; electoral campaigns. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 163",
    "title": "Public Diplomacy",
    "units": 4,
    "description": "Seminar, four hours. Exploration of field of public diplomacy and its theory and practices. How points of view and imagery in context of international politics can be influenced and changed. Development of presentation skills and understanding of structure of profession. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 166",
    "title": "Inside Hollywood",
    "units": 4,
    "description": "Lecture, four hours. Identification of how motivation and creativity interact with business interest, research, and policies in producing entertainment for media market. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 168",
    "title": "Communication and Media Law",
    "units": 4,
    "description": "Lecture, three hours. Focus on sample of most important intersections between law and communication: copyright, trademarks, freedom of speech, privacy, secrecy, surveillance, and publicity rights. Law and communication have been intertwined since introduction of book censorship and licensing in late 16th century, and blasphemy laws before that. That relationship has grown increasingly complex in time in response to technological changes in communication media, evolution of modern state forms, and changing expectations about freedom of and responsibility for both communication and information gathering. From music piracy, knock-offs of famous brands, ubiquitous presence of closed-circuit television, facial recognition software, global tracking systems, biosensors, and data mining practices, intersection between communication, media, and law has become part of our life, on scale and to extent that would have been unthinkable few years ago. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 170",
    "title": "Legal Communication",
    "units": 4,
    "description": "Lecture, three hours; discussion, one hour. Review of Fifth Amendment privilege against self-incrimination, including analysis of Miranda warnings, police interrogation procedures, coerced confessions, and why innocent people confess. Examination of jury behavior, reliability of eyewitness testimony, and fair trials. Mock trial presentation. Intimate expression and right to define one's own concept of existence and meaning, using examples of evolving rulings on same-sex marriage, abortion, and right to die. Use and misuse of grand juries in police misconduct cases, including Eric Brown, Michael Garner, and Breonna Taylor cases. Questions of judicial activism, legal precedent, and standards of review. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 171",
    "title": "Theories of Freedom of Speech and Press",
    "units": 4,
    "description": "Lecture, three hours. Exploration of relationship between freedoms of speech and press and values of liberty, self-realization, self-government, truth, dignity, respect, justice, equality, association, and community. Study of significance of these values examined in connection with issues such as obscenity, defamation, access to media, and control of commercial, corporate, and government speech. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 173",
    "title": "Affect and Emotion in Political Communication",
    "units": 4,
    "description": "Lecture, three hours. There is growing body of work in political communication that emphasizes importance of affect, emotion, and personality in politics. Sensitivity to threat or disgust; reactions of fear, anger, or happiness; tendency to focus more on negative than on positive information-each of these can impact feelings about candidates, and positions on wide range of domestic and foreign issues. Many of these feelings are in reaction to mass-mediated information; and changing media technologies likely increases volume of affective or emotional content reaching public. Review of recent work on these themes, drawn from both media psychology and political communication. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 174",
    "title": "Entertainment and Politics",
    "units": 4,
    "description": "Lecture, three hours. Research in political communication often focuses on news coverage. Our ideas about world around us do not just come from news content, however-we are affected by wide range of entertainment media as well. Consideration of how changes in media technology have increasingly broken down division between news and entertainment. Review of work on impacts that entertainment-focused media-including television shows, movies, and music-have on political preferences. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 175",
    "title": "Criticism and Public Arts",
    "units": 4,
    "description": "Lecture, four hours; discussion, one hour (when scheduled). Introduction to methods and problems of criticism in public arts. Study of several types of critical methods: formalistic, analogue, pragmatic, and aesthetic criticism. Topics include definition of art and criticism, aesthetic media, genre and resources of film, television, theater, and public discourse, varieties of critical method, problems of critical judgment. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 178",
    "title": "Propaganda and Media",
    "units": 4,
    "description": "Lecture, three hours. Examination of nature of propaganda, institutional structure of American media, and relationship between propaganda and American news media. History of propaganda in America from World War I era forward, competing theories of democracy and media, and role of corporations in propaganda and news. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 179",
    "title": "Images of U.S.",
    "units": 4,
    "description": "Lecture, four hours. Awareness of international role of U.S. necessitates clear understanding of way our nation is perceived by others. Exploration of roots of U.S. images in minds of people abroad. Analysis of influences that contribute to images and ways in which images affect practical matters. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 182",
    "title": "Nonverbal Communication in Architecture",
    "units": 4,
    "description": "Lecture, four hours. Study of how elements of design and style of various buildings in architectural history send messages to viewers and users of such buildings. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 184",
    "title": "Summer Internships",
    "units": 4,
    "description": "Tutorial, to be arranged. Internship in supervised setting in community agency or business. Students may consult with adviser and must provide final report of their experiences. May be repeated for credit. Offered in summer only. P/NP grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 185",
    "title": "Field Studies in Communication",
    "units": 2,
    "description": "Lecture, two hours. Designed for juniors/seniors. Fieldwork in communication. Students participate in two-hour seminar sessions and spend seven hours in approved community settings each week for each 2 units of credit. May be taken for maximum of 4 units per term. P/NP grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 186",
    "title": "Media, Ethics, and Digital Age: Case-Study Approach",
    "units": 4,
    "description": "Lecture, three hours. To publish or not to publish? Study addresses questions of media ethics-and ethics more broadly-using case-study method to debate pressing issues from actual newsrooms. Students participate in Socratic discussion of fairness, bias, and personal and societal implications of printed, broadcast, and digitized word. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 187",
    "title": "Ethical and Policy Issues in Institutions of Mass Communication",
    "units": 4,
    "description": "Lecture, three hours. Intensive examination of ethical and policy issues arising from interaction of media institutions (print, film, broadcasting, and new technologies) and societal institutions (Congress, federal agencies, courts, Presidency, schools, churches, political action groups, advertisers, and audiences). P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 188",
    "title": "Careers in Communication",
    "units": 1,
    "description": "Seminar, two hours. Rigorous study of communication theories, research methods, and applications prepares students to succeed in multiple fields, including technology, entertainment, journalism, non-profit, law, education, politics/government, and management. Provides practical support and skill development that helps students transition to being professional in workplace. Consultation of successful industry professionals from variety of fields to understand how they leveraged their education to excel within their organizations. P/NP grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 188A",
    "title": "Variable Topics in Mass Communication and Media Institutions",
    "units": 4,
    "description": "Lecture, four hours. Variable topics; consult Schedule of Classes for topics to be offered in specific term. May be repeated for credit with topic change. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 188B",
    "title": "Variable Topics in Interpersonal Communication",
    "units": 4,
    "description": "Lecture, three hours. Variable topics; consult Schedule of Classes for topics to be offered in specific term. May be repeated for credit with topic change. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 188C",
    "title": "Variable Topics in Communication Technology and Digital Systems",
    "units": 4,
    "description": "Lecture, four hours. Variable topics; consult Schedule of Classes for topics to be offered in specific term. May be repeated for credit with topic change. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 188D",
    "title": "Variable Topics in Political and Legal Communication",
    "units": 4,
    "description": "Lecture, four hours. Variable topics; consult Schedule of Classes for topics to be offered in specific term. May be repeated for credit with topic change. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 188E",
    "title": "Variable Topics: Practicum",
    "units": 4,
    "description": "Lecture, three hours. Practicum lectures on selected topics in communication. Reading, writing, discussion, and development of culminating project. May be repeated for credit with topic change. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 188SA",
    "title": "Individual Studies for USIE Facilitators",
    "units": 1,
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 188SB",
    "title": "Individual Studies for USIE Facilitators",
    "units": 1,
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "requisites": [
      {
        "type": "requisite",
        "course": "COMM 188SA"
      }
    ],
    "equivalentCourses": []
  },
  {
    "id": "COMM 188SC",
    "title": "Individual Studies for USIE Facilitators",
    "units": 2,
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "requisites": [
      {
        "type": "requisite",
        "course": "COMM 188SB"
      }
    ],
    "equivalentCourses": []
  },
  {
    "id": "COMM 189",
    "title": "Advanced Honors Seminars",
    "units": 1,
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 189HC",
    "title": "Honors Contracts",
    "units": 1,
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 19",
    "title": "Fiat Lux Freshman Seminars",
    "units": 1,
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 191A",
    "title": "Variable Topics Research Seminars: Mass Communication and Media Institutions",
    "units": 4,
    "description": "Seminar, three hours. Research seminars on selected topics in mass communication. Reading, discussion, and development of culminating project. May be repeated for credit with topic change. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 191B",
    "title": "Variable Topics Research Seminars: Interpersonal Communication",
    "units": 4,
    "description": "Seminar, three hours. Research seminars on selected topics in interpersonal communication. Reading, discussion, and development of culminating project. May be repeated for credit with topic change. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 191C",
    "title": "Variable Topics Research Seminars: Communication Technology and Digital Systems",
    "units": 4,
    "description": "Seminar, three hours. Research seminars on selected topics in communication technology and digital systems. Reading, discussion, and development of culminating project. May be repeated for credit with topic change. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 191D",
    "title": "Variable Topics Research Seminars: Political and Legal Communication",
    "units": 4,
    "description": "Seminar, three hours. Research seminars on selected topics in political and legal communication. Reading, discussion, and development of culminating project. May be repeated for credit with topic change. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 191E",
    "title": "Variable Topics Research Seminars: Practicum",
    "units": 4,
    "description": "Seminar, three hours. Practicum seminars on selected topics in communication. Reading, writing, discussion, and development of culminating project. May be repeated for credit with topic change. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 194",
    "title": "Research Group Seminars: Communication Studies",
    "units": 2,
    "description": "Seminar, two hours. Designed for undergraduate students who are part of research group. Discussion of research methods and current literature in field or of research of faculty members or students. May be repeated for credit. P/NP grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 195",
    "title": "Summer Internships",
    "units": 4,
    "description": "Tutorial, to be arranged. Internship in supervised setting in community agency or business. Students meet with adviser and provide final reports of their experiences. May be repeated for credit. Individual contract with supervising faculty member required. Offered in summer only. P/NP grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 195DB",
    "title": "UCLA Daily Bruin and Student Media Internship",
    "units": 2,
    "description": "Tutorial, one hour. Limited to students participating in Daily Bruin. Intended to help students get most benefit from their internship experience with UCLA student media. Students meet biweekly with instructor, provide periodic reports on their experience, and engage with industry mentors. May be taken for maximum of 12 units. P/NP grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 197",
    "title": "Individual Studies in Communication Studies",
    "units": 2,
    "description": "Tutorial, one hour. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject area required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 198A",
    "title": "Honors Research in Communication Studies",
    "units": 4,
    "description": "Tutorial, three hours. Requisites: courses 10, 150. Limited to junior/senior majors. Development of comprehensive research project under direct supervision of faculty member. May be repeated for credit. Individual contract required. Letter grading.",
    "requisites": [
      {
        "type": "requisite",
        "course": "COMM 10"
      },
      {
        "type": "requisite",
        "course": "COMM 150"
      }
    ],
    "equivalentCourses": []
  },
  {
    "id": "COMM 198B",
    "title": "Honors Research in Communication Studies",
    "units": 4,
    "description": "Tutorial, three hours. Requisite: course 198A. Limited to junior/senior majors. Continuation of work initiated in course 198A. Presentation of summary of data gathered and relevant progress to supervising faculty member. May be repeated for credit. Individual contract required. Letter grading.",
    "requisites": [
      {
        "type": "requisite",
        "course": "COMM 198A"
      }
    ],
    "equivalentCourses": []
  },
  {
    "id": "COMM 198C",
    "title": "Honors Research in Communication Studies",
    "units": 4,
    "description": "Tutorial, three hours. Requisite: course 198B. Limited to junior/senior majors. Completion of research developed in courses 198A, 198B. Presentation of honors project to supervising faculty member. May be repeated for credit. Individual contract required. Letter grading.",
    "requisites": [
      {
        "type": "requisite",
        "course": "COMM 198B"
      }
    ],
    "equivalentCourses": []
  },
  {
    "id": "COMM 199",
    "title": "Directed Research or Senior Project in Communication Studies",
    "units": 2,
    "description": "Tutorial, one hour. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 1A",
    "title": "Public Speaking for Nonnative Speakers",
    "units": 4,
    "description": "Lecture, four hours. Designed for nonnative speakers of English to increase fluency and vocabulary while improving presentation skills, language usage, reasoning, style, and delivery. Conversation and pronunciation practice. Focus on theory and practice of public speaking, including selection of content, organization of ideas, language, and delivery. Practice in extemporaneous and manuscript speaking. Critical analysis of speeches in both contemporary and historical settings. Special emphasis on group discussions, evaluations, practice of both public and private speaking skills. Offered in summer only. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 1B",
    "title": "Learning American English and Culture from Movies",
    "units": 4,
    "description": "Lecture, four hours. Advancement of students' fluency in conversational English while increasing their awareness of American popular culture. Primer on American-style colloquial English and nuances of contemporary customs and values offered through guided immersion in popular cinema. Offered in summer only. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 200",
    "title": "Theories in Communication Science",
    "units": 4,
    "description": "Seminar, three hours. Exploration of theoretical and methodological approaches that bridge major areas of current interdisciplinary communication science research. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 201A",
    "title": "Advanced Statistics for Social Sciences I",
    "units": 4,
    "description": "Lecture, two and one half hours. Introduction to fundamental concepts of statistics, including probability, inferential techniques, data visualization, and hypothesis testing. Emphasis on theoretical understanding and practical implementation using statistical software (R and Python). Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 201B",
    "title": "Advanced Statistics for Social Sciences II",
    "units": 4,
    "description": "Lecture, two and one half hours. Requisite: course 201A. Review of multiple regression, logistic regression, multilevel models, and causal inference. Includes experience with fitting, diagnosing, and interpreting advanced regression models using statistical software (R and Python). Letter grading.",
    "requisites": [
      {
        "type": "requisite",
        "course": "COMM 201A"
      }
    ],
    "equivalentCourses": []
  },
  {
    "id": "COMM 205",
    "title": "Professional Pathways",
    "units": 1,
    "description": "Seminar, one hour. Earning PhD in any of allied social, cognitive, and computational sciences can support multiple career paths. Doctoral students are exposed to range of career pathways. Each meeting focuses on one possible career path and features guest speaker who works in that particular industry. S/U grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 210",
    "title": "Communication Speaker Series",
    "units": 2,
    "description": "Seminar, 90 minutes. Designed for graduate students in social and natural sciences. Weekly speaker presentations in communication sciences. Focus on interdisciplinary approaches to psychological, political, and computational communication. S/U grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 215",
    "title": "Communication Research Laboratory",
    "units": 1,
    "description": "Research group meeting, one hour. Limited to graduate students. Designed for graduate students in social and natural sciences. Discussion of current research issues and preliminary findings. Opportunities for feedback on current and proposed research activity. Assigned readings included. May be repeated for credit. S/U grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 220",
    "title": "Research Methods in Communication Science",
    "units": 4,
    "description": "Seminar, three hours. Study of how communication science research is conducted with focus on quantitative methodology. Students gain understanding of tools used to conduct research, and experience with these tools through formulating own research ideas and projects. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 230",
    "title": "Communication and Cognition",
    "units": 4,
    "description": "Seminar, three hours. Exploration of how cognitive processes underlie multiple aspects of communication, including its evolutionary and biological underpinnings, its relevance for broad types of communication (e.g., interpersonal and mass media), and its integrative capacity across multiple areas of social science research. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 231",
    "title": "Advances in Science of Interpersonal Human Communication",
    "units": 4,
    "description": "Seminar, three hours. Examination of quantitative approaches to interpersonal communication processes. Topics include measuring human interactive behavior, experimentation and observational research contexts, and testing theories of human interactive behavior using computational models. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 232",
    "title": "Infant Communication",
    "units": 4,
    "description": "Seminar, three hours. Covers topics in development of interpersonal communication during infancy including neural and social mechanisms, role of culture, clinical issues, and research methodology. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 233",
    "title": "Evolution, Sex/Gender, and Communication",
    "units": 4,
    "description": "Seminar, three hours. Sex-typically, male versus female-is fundamental social category with broad social and biological relevance. It influences our interests, preferences, social strategies, how we communicate with others. It also influences what others expect from us. Within context of this course, term gender refers to one's location on continua of femininity (female-typical) and masculinity (male-typical), including identifying as neither male- nor female-typical. Like sex, gender affects how we approach social world and how social world responds to us. Exploration of deep evolutionary foundations of sex and gender, and their modern manifestations. Topics covered may include evolutionary mismatches between ancestral past and modern present, sex/gender and mass media, navigating world of shifting gender norms, and how sex/gender influences interpersonal relationships and sexuality. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 235",
    "title": "Evolution of Vocal Communication",
    "units": 4,
    "description": "Seminar, three hours. Examination of current research in evolutionary approaches to vocal communication. Topics include introduction to acoustic phonetics, animal signaling, and social communication. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 236",
    "title": "Humans and Machines",
    "units": 4,
    "description": "Seminar, three hours. Examination of communication in human-machine interactions, exploring idea that well-established psychological processes play critical roles in interactions with non-social objects. Examination of social psychology of perception across distinct sensory modalities (shape, motion, voice, touch). Study of social psychological processes between humans and non-human entities (objects, computers, robots). S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 237",
    "title": "Prediction and Conjecture in Communicative Behavior",
    "units": 4,
    "description": "Seminar, three hours. Examination of range of domain-specific communicative conjectures. In advertising, conjectural dimensions of communication play central role in structuring historical development of strategies and innovations. Examination of phenomenon of resistance and introduction of concept of communicative potential. In entertainment, examination of cognitive processes of viewpoint projection, playful exploration of new forms of interaction, and investigation of development of heuristics for creatively constraining searches in infinite possibility spaces. In education, consideration of dynamics of student and instructor dialogically developing conjectural plans for guiding student cost-effectively into productive new spaces of learning. In context of television news and other forms of broadcast communication, examination of role of verbal and non-verbal signals in opening and closing conjectural discursive spaces. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 250",
    "title": "Political Communication",
    "units": 4,
    "description": "Seminar, three hours. Consideration of determinants of media content and degree to which Americans' political opinions and actions are influenced by that content. Specific topics include history of news media, recent media trends, theories of attitude formation and change, media bias, role of sources in construction of news, economics of news production and consumption, ways in which media shape public perceptions of political world, campaign communication, and general role of mass media in democratic process. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 251",
    "title": "Presidential Communication",
    "units": 4,
    "description": "Seminar, three hours. Examination of one vital source of presidency's burgeoning power: president's unmatched communication power. Study of historical evolution of president's communication environment, resources, and strategies. Exploration of how presidential campaign communication has evolved over time, and implications of this evolution for how presidents govern. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 252",
    "title": "Political Parties and Strategic Partisan Communication",
    "units": 4,
    "description": "Seminar, three hours. Examination of theories about how political parties operate in countries around world. Covers topics including normative role of parties in modern democracies, reasons why parties exist, party competition, electoral systems, variation in number and types of parties across countries, party identification, voting, and internal party dynamics. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 253",
    "title": "Affective Political Communication",
    "units": 4,
    "description": "Seminar, three hours. Consideration of role that affect plays in production and consumption of political news, and in political communication, behavior, and psychology. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 254",
    "title": "Media and Politics",
    "units": 4,
    "description": "Seminar, three hours. Mass media play a critical role in domestic and international politics, and are a central component of modern representative democracy. Review of major questions in the study of mass media and politics, in the U.S. and cross-nationally. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 270",
    "title": "Computational Communication",
    "units": 4,
    "description": "Seminar, three hours. New computational methods developed and applied for communication research along with massive datasets and computing infrastructure enable large-scale quantitative analyses on human communication and activities at scale. Introduction to state-of-art methods in computational social science and how they can apply in communication research. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 271",
    "title": "Networks",
    "units": 4,
    "description": "Seminar, three hours. Covers theory and applications from scientific study of networks. Students learn to use network analysis and visualization software and collect and analyze original network data. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 272",
    "title": "Cognitive Artificial Intelligence",
    "units": 4,
    "description": "Seminar, three hours. Study demonstrates how to build artificial intelligence by following principles of human intelligence revealed by cognitive science. These principles include learning from small data; capturing causality of physical world; inferring others' mental states for intuitive cooperation and communication. To achieve this goal, tools are drawn from cognitive science, social sciences, artificial intelligence, computer vision, and robotics. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 273",
    "title": "Big Data Analysis with Machine Learning",
    "units": 4,
    "description": "Seminar, three hours. Preparation: familiarity with coding (Python or R) and basic statistical analysis. Introduction to advanced machine learning methods that can apply to large-scale datasets in text, audio, and visual data modalities. Students learn how to develop, train, and validate machine learning models and apply methods to their own research. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 277",
    "title": "Algorithms and Society",
    "units": 4,
    "description": "Seminar, three hours. Preparation: background in statistical inference and basic proficiency in Python programming. With ever-expanding prevalence of digital technology, imagining a counterfactual world without it grows increasingly complex. Examination of how algorithms shape society, impact democracy, and propagate bias. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 596",
    "title": "Directed Individual Study or Research",
    "units": 2,
    "description": "Tutorial, to be arranged. Limited to Communication graduate students. Directed study on variable topics in consultation with faculty member. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 597",
    "title": "Preparation for PhD Qualifying Examination",
    "units": 2,
    "description": "Tutorial, to be arranged. Limited to Communication PhD graduate students. Reading and preparation for PhD qualifying examination. Mandatory and supplemental reading lists approved by student advisory committee. May be repeated for credit as necessary with consent of adviser. S/U grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 599",
    "title": "Research for PhD Dissertation",
    "units": 2,
    "description": "Tutorial, to be arranged. Preparation: successful completion of qualifying examinations. Limited to Communication PhD graduate students. May be repeated for credit. S/U grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 88",
    "title": "Sophomore Seminars: Communication Studies",
    "units": 4,
    "description": "Seminar, three hours. Limited to maximum of 20 lower-division students. Readings and discussions designed to introduce students to current research in discipline. Culminating project may be required. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 89",
    "title": "Honors Seminars",
    "units": 1,
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 89HC",
    "title": "Honors Contracts",
    "units": 1,
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM 99",
    "title": "Student Research Program",
    "units": 1,
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M113",
    "title": "Nonverbal Communication and Body Language",
    "units": 4,
    "description": "(Same as Psychology M137B.) Lecture, three hours. Examination of how various forms of nonverbal communication convey meaningful information to perceivers, with focus on both production and perception of multiple communication formats (e.g., affect expression of face and body, gesture, and kinematics), with strong emphasis on body language. Readings from variety of related fields. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M117",
    "title": "Negotiation",
    "units": 4,
    "description": "(Same as Labor Studies M117.) Lecture, four hours. Art and science of negotiation in securing agreements between independent parties. Theory and practice that underlies successful negotiation. Experiential course in which students learn broad array of negotiation skills, including identifying one's own (and others') communication style, identifying and incorporating components of successful negotiation, and resolving conflict between parties. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M123",
    "title": "Social Cognition",
    "units": 4,
    "description": "(Formerly numbered 123.) (Same as Psychology M137M.) Lecture, three hours. Survey of research from field of social cognition, with emphasis on understanding cognitive processes involved in interpersonal and intergroup communication. Topics include attention, interpretation, evaluation, judgment, attribution, and memory processes. Consideration of both controlled and automatic processes. Discussion of roles of motives, goals, and affective variables. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M124",
    "title": "Evolution of Language",
    "units": 4,
    "description": "(Same as Anthropology M124R.) Lecture, three hours; discussion, one hour (when scheduled). Recommended preparation: Anthropology 1 or 4 or Linguistics 1. Designed for juniors and seniors. How did human capacity for language evolve? Examination of origin of human language from biological, comparative, developmental, social and computational perspectives. Topics include evolutionary theory, linguistic structure, gesture and speech, animal communication, language learning, language disorders, and computational models of language emergence. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M125",
    "title": "Talk and Social Institutions",
    "units": 4,
    "description": "(Same as Sociology CM125.) Lecture, four hours; discussion, one hour. Designed for juniors/seniors. Practices of communication and social interaction in number of major institutional sites in contemporary society. Setting varies but may include emergency services, police and courts, medicine, news interviews, and political oratory. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M127",
    "title": "Animal Communication",
    "units": 4,
    "description": "(Same as Anthropology M128Q.) Lecture, three hours. Designed for Anthropology and Communication majors. Evolution, functions, design, and diversity of animal communication systems such as bird song, dolphin calls, whale song, primate social signals, and human language. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M144A",
    "title": "Conversational Structures I",
    "units": 4,
    "description": "(Same as Sociology CM124A.) Lecture, three hours; discussion, one hour. Introduction to various structures employed in organization of conversational interaction, such as turn-taking, action sequencing, and repair. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M144B",
    "title": "Conversational Structures II",
    "units": 4,
    "description": "(Same as Sociology M124B.) Lecture, three hours; discussion, one hour. Requisite: course M144A. Consideration of some more expanded sequence structures, story structures, topical sequences, and overall structural organization of single conversations. P/NP or letter grading.",
    "requisites": [
      {
        "type": "requisite",
        "course": "COMM M144A"
      }
    ],
    "equivalentCourses": []
  },
  {
    "id": "COMM M147",
    "title": "Sociology of Mass Communication",
    "units": 4,
    "description": "(Same as Sociology M176.) Lecture, four hours; discussion, one hour (when scheduled). Studies in relationship between mass communication and social organization. Topics include history and organization of major media institutions, social forces that shape production of mass media news and entertainment, selected studies in media content, and effects of media on society. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M149",
    "title": "Media: Gender, Race, Class, and Sexuality",
    "units": 5,
    "description": "(Same as Gender Studies M149 and Labor Studies M149.) Lecture, four hours; activity, one hour. Limited to junior/senior Communication and Gender Studies majors and Labor Studies minors. Examination of manner in which media culture induces people to perceive various dominant and dominated and/or colonized groups of people. Ways in which women, gay, lesbian, bisexual, transgendered, racial, and ethnic marginalized peoples, class relations, and other subaltern or subordinated groups are presented and often misrepresented in media. Investigation and employment of practical applications of communications and feminist theories for understanding ideological nature of stereotyping and politics of representation through use of media, guest presentations, lectures, class discussions, and readings. Introduction to theory and practice of cultural studies. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M165",
    "title": "Agitational Communication",
    "units": 4,
    "description": "(Same as Labor Studies M175.) Lecture, four hours; discussion, one hour (when scheduled). Theory of agitation; agitation as force for change in existing institutions and policies in democratic society. Intensive study of selected agitational movements and technique and content of their communications. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M169",
    "title": "Critical Vision: History of Art as Social and Political Commentary",
    "units": 5,
    "description": "(Same as Honors Collegium M179.) Seminar, three hours. Study of tradition of visual arts (painting, graphic art, photography, sculpture) as vehicles for social and political commentary. P/NP or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M176",
    "title": "Visual Communication and Social Advocacy",
    "units": 4,
    "description": "(Same as Labor Studies M176.) Lecture, four hours. Visual communication reaches diverse audiences in communicating major social and political topics. Cartoons, posters, murals, and documentary photography have had powerful world impact. Survey of all four genres of visual communications as features of modern mass media. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M191DC",
    "title": "CAPPP Washington, DC, Research Seminars",
    "units": 8,
    "description": "(Same as History M191DC, Political Science M191DC, Public Affairs M191DC, and Sociology M191DC.) Seminar, three hours. Limited to CAPPP Program students. Seminars for undergraduate students in Center for American Politics and Public Policy's program in Washington, DC. Focus on development and execution of original empirical research based on experiences from Washington, DC-based field placements. Study of variety of qualitative methods (observation, interviewing, etc.), with comparison to quantitative analysis. Examination of features of solid and significant research; intensive writing. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M232C",
    "title": "Cognitive Artificial Intelligence",
    "units": 4,
    "description": "(Same as Statistics M232C.) Lecture, three hours. Recommended requisites: Statistics M232A, M232B. Demonstration of how to build artificial intelligence by following principles of human intelligence revealed by cognitive science, including learning from small data, expressing causality of physical world, and inferring mental states of others for intuitive social interactions. Draws from statistical modeling, cognitive science, artificial intelligence, computer vision, and robotics. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M234",
    "title": "Social Vision",
    "units": 4,
    "description": "(Same as Psychology M222G.) Seminar, three hours. Exploration of nascent field of social vision, with emphasis on how observers utilize visible cues in face and body to form impressions of other people and how these perceptions are moderated by existing knowledge structures and motivations. S/U or letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M72A",
    "title": "Sex from Biology to Gendered Society",
    "units": 6,
    "description": "(Same as Clusters M72A, Society and Genetics M72A, and Sociology M72A.) Lecture, three hours; discussion, two hours. Course M72A is enforced requisite to M72B, which is enforced requisite to M72CW. Limited to first-year freshmen. Examination of many ways in which sex and sexual identity shape and are shaped by biological and social forces, approached from complementary perspectives of anthropology, biology, medicine, and sociology. Specific topics include biological origins of sex differences, intersex, gender identity, gender inequality, homosexuality, sex differences, sex/gender and law, and politics of sex research. Letter grading.",
    "requisites": [],
    "equivalentCourses": []
  },
  {
    "id": "COMM M72B",
    "title": "Sex from Biology to Gendered Society",
    "units": 6,
    "description": "(Same as Clusters M72B, Society and Genetics M72B, and Sociology M72B.) Lecture, three hours; discussion, two hours. Enforced requisite: course M72A. Limited to first-year freshmen. Examination of many ways in which sex and sexual identity shape and are shaped by biological and social forces, approached from complementary perspectives of anthropology, biology, medicine, and sociology. Specific topics include biological origins of sex differences, intersex, gender identity, gender inequality, homosexuality, sex differences, sex/gender and law, and politics of sex research. Letter grading.",
    "requisites": [
      {
        "type": "requisite",
        "course": "COMM M72A"
      }
    ],
    "equivalentCourses": []
  },
  {
    "id": "COMM M72CW",
    "title": "Sex from Biology to Gendered Society: Special Topics",
    "units": 6,
    "description": "(Same as Clusters M72CW, Society and Genetics M72CW, and Sociology M72CW.) Seminar, three hours. Enforced requisite: course M72B. Limited to first-year freshmen. Topics may include politics of reproduction, sexuality, sexual identity, social construction of gender, and reproductive technologies. Satisfies Writing II requirement. Letter grading.",
    "requisites": [
      {
        "type": "requisite",
        "course": "COMM M72B"
      }
    ],
    "equivalentCourses": []
  }
]