[
    {
        "id": "PORTGSE 1",
        "title": "Elementary Portuguese",
        "units": 4,
        "description": "Lecture, three hours; laboratory, two hours. Taught in Portuguese. Laboratory is online. Introductory Portuguese language and culture course that is proficiency-oriented, communicative, and task-based to help develop communicative competence in four skill areas (listening, speaking, reading, and writing), as well as cultural competence. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 100A",
        "title": "Phonology and Morphology",
        "units": 4,
        "description": "Lecture, four hours. Enforced requisite: course 27. Analysis of phonetic, phonemic, and morphological systems of Portuguese. P/NP or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 100B",
        "title": "Syntax",
        "units": 4,
        "description": "Lecture, four hours. Enforced requisite: course 27. Review of patterns of Portuguese language. P/NP or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 11A",
        "title": "Intensive Portuguese",
        "units": 5,
        "description": "Lecture, four hours; laboratory, two hours. Taught in Portuguese. Laboratory is online. Accelerated course designed only for students with proficiency in another Romance language. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 11B",
        "title": "Intensive Portuguese",
        "units": 5,
        "description": "Lecture, four hours; laboratory, two hours. Taught in Portuguese. Laboratory is online. Accelerated course designed only for students with proficiency in another Romance language. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 13",
        "title": "Intensive Introductory Portuguese Language and Culture",
        "units": 12,
        "description": "Lecture, 20 hours; laboratory, three hours. Intensive introduction to Portuguese language and culture equivalent to courses 1, 2, and 3, and 11A and 11B. Proficiency-oriented, communicative and task-based approach intended to facilitate communicative competence in four language skills areas: listening, speaking, reading, and writing. Development of cultural awareness of heterogeneous Portuguese-speaking community in America, Europe, and Africa. Intensive accelerated course designed to help students increases their ability to communicate in Portuguese. Offered in summer only. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 130A",
        "title": "Introduction to Literature in Portuguese",
        "units": 4,
        "description": "Lecture, four hours. Requisite: course 25 or 26 or 27. Introduction to principal themes, currents, and authors from Brazil in context of Portuguese-speaking world. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 25"},{"type": "requisite","course": "PORTGSE 26"},{"type": "requisite","course": "PORTGSE 27"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 130B",
        "title": "Introduction to Literature in Portuguese",
        "units": 4,
        "description": "Lecture, four hours. Requisite: course 25 or 26 or 27. Introduction to principal themes, currents, and authors from Brazil in context of Portuguese-speaking world. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 25"},{"type": "requisite","course": "PORTGSE 26"},{"type": "requisite","course": "PORTGSE 27"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 141A",
        "title": "Literature and Film in Portuguese",
        "units": 4,
        "description": "Lecture, four hours. Taught in English. Study of intertextuality and dialogism, interactions between literary and cinematic fields, question of fidelity, and equivalents between literary and cinematic expression in Portuguese-speaking world. May be repeated for credit with topic change. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 141B",
        "title": "Film, Television, and Society in Brazil",
        "units": 4,
        "description": "Lecture, four hours. Taught in English. Study of development, evolution, and impact of film and television in Brazil against backdrop of broader social, historical, and cultural contexts. May be repeated for credit. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 141C",
        "title": "Documentary Film",
        "units": 4,
        "description": "Lecture, four hours. Taught in English. Overview of documentary film production in Portuguese-speaking world, with special focus on period since 1985. May be repeated for credit with topic change. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 142A",
        "title": "Brazil and Its Culture",
        "units": 4,
        "description": "Lecture, four hours. Taught in English. Exploration of roots of contemporary Brazil through study of broad chronological periods from Portuguese colonization to present and how they shaped idea of Brazilian exceptionalism, racial mixture as source of national identity, and lusotropicalism and its influence on Brazilian historiography. May be repeated for credit with topic change. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 142B",
        "title": "Brazil and Portugal in Comparative Perspective",
        "units": 4,
        "description": "Lecture, four hours. Taught in English. Study of social and cultural links between Portugal and Brazil, with emphasis on issues of migration, dialogue, and contention in historical context. May be repeated for credit with topic change. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 143A",
        "title": "Colony, Intellectuals, and History",
        "units": 4,
        "description": "Lecture, four hours. Enforced requisite: course 27. Investigation of way that Brazilian maritime expansion from 15th to early 19th century was represented and interpreted in writings from across empire. May be repeated for credit with topic change. P/NP or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 143B",
        "title": "Transatlantic Literature in Portuguese",
        "units": 4,
        "description": "Lecture, four hours. Enforced requisite: course 27. Study of modern relations between Portugal and Portuguese-speaking world in literature and arts. May be repeated for credit with topic change. P/NP or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 143C",
        "title": "Modernism, Modernity, and Identity",
        "units": 4,
        "description": "Lecture, four hours. Requisite: course 25 or 26 or 27. Examination of concepts and practice of modernism in Portuguese-speaking world, with primary focus on 1920s. Reading and discussion, with emphasis on sociohistorical context, relations with European avant-garde, modernist poetics and polemics, and search for national identity as expressed in period's poetry and prose. May be repeated for credit with topic change. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 25"},{"type": "requisite","course": "PORTGSE 26"},{"type": "requisite","course": "PORTGSE 27"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 143D",
        "title": "Contemporary Literature in Portuguese",
        "units": 4,
        "description": "Lecture, four hours. Requisite: course 25 or 26 or 27. Exploration of connections between literatures of Angola, Brazil, and Portugal against background of globalization and Internet. May be repeated for credit with topic change. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 25"},{"type": "requisite","course": "PORTGSE 26"},{"type": "requisite","course": "PORTGSE 27"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 175",
        "title": "Topics in Creative Writing and Literary Translation",
        "units": 4,
        "description": "Seminar, three hours. Requisite: course 25 or 26 or 27. Exploration of art of translation or creative writing. Guest speakers or instructors include professional literary translators, poets, novelists, playwrights, and filmmakers who discuss theory, methodology, and practice of their art. May be repeated for credit with topic change. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 25"},{"type": "requisite","course": "PORTGSE 26"},{"type": "requisite","course": "PORTGSE 27"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 180",
        "title": "Topics in Visual Culture",
        "units": 4,
        "description": "Lecture, four hours; discussion, one hour (when scheduled). Requisite: Portuguese 25 or 26 or 27. Study of visual knowledge production in Latin America and Iberia as complex relation between visual subjects, practices, and representation in Latin American, Afro-Luso-Brazilian, and Iberian contexts. Objects of analysis may include architecture and urban design, digital media and other technologies, documentaries, fashion, fictional and experimental films, graphic novels and other media, maps and cartography, photography, plastic arts, and art history, theater and performance, video, among others. May be repeated four times for credit with topic change. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 25"},{"type": "requisite","course": "PORTGSE 26"},{"type": "requisite","course": "PORTGSE 27"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 187FL",
        "title": "Special Studies: Readings in Portuguese",
        "units": 2,
        "description": "Seminar, two hours. Requisite: course 27. Students must be concurrently enrolled in affiliated main course. Additional work in Portuguese to augment work assigned in main course, including reading and writing assignments. May be repeated for credit. P/NP or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 189",
        "title": "Advanced Honors Seminars",
        "units": 1,
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 189HC",
        "title": "Honors Contracts",
        "units": 1,
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 19",
        "title": "Fiat Lux Freshman Seminars",
        "units": 1,
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 191",
        "title": "Undergraduate Variable Topics Seminars: Portuguese",
        "units": 4,
        "description": "Seminar, three hours. Requisite: course 25 or 26 or 27. Research seminar on selected topics in Portuguese. Reading, discussion, and development of culminating project. Consult Schedule of Classes or department counselor for topic to be offered in specific term. May be repeated for credit. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 25"},{"type": "requisite","course": "PORTGSE 26"},{"type": "requisite","course": "PORTGSE 27"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 195",
        "title": "Community Internships in Portuguese",
        "units": 4,
        "description": "Tutorial, two hours; fieldwork, eight hours. Requisite: course 25 or 26 or 27. Limited to juniors/seniors. Community-engaged learning is teaching and learning strategy that integrates meaningful community service with instruction and critical reflection to enrich the learning experience, teach civic responsibility, and strengthen communities. Students use cultural and linguistic knowledge acquired in classes and research in real-world setting through 8-10 hours per week of volunteer work in on- or off-campus organization or unit serving Brazilian and Portuguese-speaking community. May be repeated for credit. Individual contract with supervising faculty member required. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 25"},{"type": "requisite","course": "PORTGSE 26"},{"type": "requisite","course": "PORTGSE 27"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 197",
        "title": "Individual Studies in Portuguese",
        "units": 2,
        "description": "Tutorial, to be arranged. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. Eight units of courses 197 and/or 199 may be applied toward major requirements. May be repeated for maximum of 8 units. Individual contract required. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 198A",
        "title": "Senior Honors Research in Portuguese I",
        "units": 4,
        "description": "Tutorial, to be arranged. Preparation: completion of minimum of six upper-division major core courses with 3.7 grade-point average. Course 198A is enforced requisite to 198B. Limited to juniors/seniors. Development and completion of honors thesis under direct supervision of faculty member. May not be applied toward major requirements. Individual contract required. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 198B",
        "title": "Senior Honors Research in Portuguese II",
        "units": 2,
        "description": "Tutorial, to be arranged. Preparation: completion of minimum of six upper-division major core courses with 3.7 grade-point average. Enforced requisite: course 198A. Limited to juniors/seniors. Development and completion of honors thesis under direct supervision of faculty member. May not be applied toward major requirements. Individual contract required. Letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 198A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 199",
        "title": "Directed Research in Portuguese",
        "units": 2,
        "description": "Tutorial, to be arranged. Requisite: course 27. Limited to juniors/seniors. Supervised individual research under guidance of faculty mentor. Culminating paper required. Eight units of courses 197 and/or 199 may be applied toward major requirements. May be repeated for credit. Individual contract required. P/NP or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 2",
        "title": "Elementary Portuguese",
        "units": 4,
        "description": "Lecture, three hours; laboratory, two hours. Taught in Portuguese. Laboratory is online. Introductory Portuguese language and culture course that is proficiency-oriented, communicative, and task-based to help develop communicative competence in four skill areas (listening, speaking, reading, and writing), as well as cultural competence. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 202",
        "title": "Synchronic Morphology and Phonology",
        "units": 4,
        "description": "Lecture, three hours. Study of theoretical synchronic linguistics as applied to Portuguese.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 204A",
        "title": "Generative Grammar",
        "units": 4,
        "description": "Lecture, three hours. Course 204A is requisite to 204B. Generative approach to the Portuguese language, with some consideration of bearing of syntax, semiology, and phonology on style, metaphor, and meter.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 204B",
        "title": "Generative Grammar",
        "units": 4,
        "description": "Lecture, three hours. Requisite: course 204A. Generative approach to the Portuguese language, with some consideration of bearing of syntax, semiology, and phonology on style, metaphor, and meter.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 204A"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 224",
        "title": "Early Portuguese Literature",
        "units": 4,
        "description": "Lecture, three hours. Enforced requisite: course 27. Study of main genres of medieval Portuguese and Galician literature through representative works. S/U or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 225",
        "title": "Camoes and Portuguese Renaissance",
        "units": 4,
        "description": "Lecture, three hours. Enforced requisite: course 27. Study of main genres of Renaissance Portuguese literature, with particular emphasis on works of Luis de Camões. S/U or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 226",
        "title": "Baroque and Neoclassical Portuguese Literature",
        "units": 4,
        "description": "Lecture, three hours. Enforced requisite: course 27. Study of main genres of baroque and neoclassical Portuguese literature through representative works. S/U or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 227",
        "title": "19th-Century Portuguese Literature",
        "units": 4,
        "description": "Lecture, three hours. Enforced requisite: course 27. Study of principal features through representative works. May be repeated for credit with topic change. S/U or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 228",
        "title": "Post-Romanticism and Naturalism in Portuguese Literature",
        "units": 4,
        "description": "Lecture, three hours. Enforced requisite: course 27. Study of principal features through representative works. S/U or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 229",
        "title": "20th-Century Portuguese Literature",
        "units": 4,
        "description": "Lecture, three hours. Enforced requisite: course 27. Study of representative trends and authors. May be repeated for credit with topic change. S/U or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 231",
        "title": "Colonial Brazilian Literature and Culture",
        "units": 4,
        "description": "Lecture, three hours. Enforced requisite: course 27. Study of most important authors to 1830. May be repeated for credit with topic change. S/U or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 232",
        "title": "19th-Century Brazilian Literature and Culture",
        "units": 4,
        "description": "Lecture, three hours. Study of representative trends and authors. May be repeated for credit with topic change. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 233",
        "title": "Machado de Assis",
        "units": 4,
        "description": "Lecture, three hours. Study of selected works by Joaquim Maria Machado de Assis. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 234",
        "title": "Brazilian Modernism",
        "units": 4,
        "description": "Lecture, three hours. Enforced requisite: course 27. Study of principal characteristics of Brazilian modernism through representative works. S/U or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 235",
        "title": "20th-Century Brazilian Literature",
        "units": 4,
        "description": "Lecture, three hours. Enforced requisite: course 27. Study of representative trends and authors. May be repeated for credit with topic change. S/U or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 27"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 25",
        "title": "Advanced Portuguese",
        "units": 4,
        "description": "Lecture, three hours. Enforced requisite: course 3 or 11B. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 3"},{"type": "requisite","course": "PORTGSE 11B"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 252",
        "title": "Studies in Early Portuguese Literature",
        "units": 4,
        "description": "Discussion, two hours. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 253",
        "title": "Studies in Modern Portuguese Literature",
        "units": 4,
        "description": "Discussion, two hours. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 254",
        "title": "Studies in Early Brazilian Literature",
        "units": 4,
        "description": "Discussion, two hours. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 255",
        "title": "Studies in Modern Brazilian Literature",
        "units": 4,
        "description": "Discussion, two hours. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 256A",
        "title": "Studies in Portuguese Linguistics",
        "units": 4,
        "description": "Lecture, two hours. Study of problems in analysis and description of contemporary Portuguese language. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 256B",
        "title": "Studies in Portuguese Linguistics",
        "units": 4,
        "description": "Lecture, two hours. Study of problems in analysis and description of contemporary Portuguese language. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 25A",
        "title": "Advanced Portuguese: Summer Course",
        "units": 4,
        "description": "Lecture, 20 hours. Enforced requisite: course 3 or 11B. Advanced Portuguese course with cultural activities, field trips, and luncheons. Offered in summer only. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 3"},{"type": "requisite","course": "PORTGSE 11B"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 26",
        "title": "Language and Popular Culture",
        "units": 4,
        "description": "Lecture, three hours. Requisite: course 3 or 11B. Development of speaking, reading, and writing skills. Structured in thematic units, with songs, videos, and specific vocabulary emphasizing questions of Brazilian cultural identity. Letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 3"},{"type": "requisite","course": "PORTGSE 11B"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 26A",
        "title": "Language and Popular Culture: Summer Course",
        "units": 4,
        "description": "Lecture, 20 hours. Enforced requisite: course 3 or 11B. Development of speaking, reading, and writing skills. Structured in thematic units, with songs, videos, and specific vocabulary emphasizing questions of Brazilian cultural identity. Includes cultural activities, field trips, and luncheons. Offered in summer only. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 3"},{"type": "requisite","course": "PORTGSE 11B"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 27",
        "title": "Writing Studies: Afro-Luso-Brazilian World",
        "units": 4,
        "description": "Lecture, three hours. Requisite: course 3 or 11B. Further development of communicative skills, especially writing. Discussions and activities increase knowledge and ability to comprehend variety of forms of cultural production in Portuguese language. Students continue to acquire cultural competence. Introduction to study of literature, with specific focus on themes and topics pertinent to Lusophone world. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 3"},{"type": "requisite","course": "PORTGSE 11B"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 27A",
        "title": "Advanced Composition and Style: Summer Course",
        "units": 4,
        "description": "Lecture, 20 hours. Enforced requisite: course 3 or 11B. Practice in writing Portuguese with appropriate vocabulary, syntactical structures, and stylistic patterns. Includes cultural activities, field trips, and luncheons. Offered in summer only. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 3"},{"type": "requisite","course": "PORTGSE 11B"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 290",
        "title": "Special Topics",
        "units": 4,
        "description": "Discussion, two hours. Designed for graduate students. Consult Schedule of Classes or department counselor for topics to be offered in a specific term. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 296",
        "title": "Graduate Research Group",
        "units": 2,
        "description": "Research group meeting, two hours. Limited to graduate students. Designed to bring together graduate students in seminar setting with one or more faculty members to discuss and critique individual research projects, especially dissertation research. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 3",
        "title": "Intermediate Portuguese",
        "units": 4,
        "description": "Lecture, three hours; laboratory, two hours. Taught in Portuguese. Laboratory is online. Intermediate Portuguese language and culture course that is proficiency-oriented, communicative, and task-based to help develop communicative competence in four skill areas (listening, speaking, reading, and writing), as well as cultural competence. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 370",
        "title": "Teaching Portuguese in Secondary School",
        "units": 4,
        "description": "Discussion, three hours. Designed for future teachers in this field. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 40A",
        "title": "Portuguese, Brazilian, and African Literature in Translation: Portuguese and Portuguese-African Literature",
        "units": 4,
        "description": "Lecture, three hours. Reading and discussion of selected works in translation. Papers and examinations in English. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 40B",
        "title": "Portuguese, Brazilian, and African Literature in Translation: Brazilian Literature",
        "units": 5,
        "description": "Lecture, four hours. Reading and discussion of selected works in translation. Papers and examinations in English. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 46",
        "title": "Brazil and Portuguese-Speaking World",
        "units": 5,
        "description": "Lecture, four hours; discussion, one hour (when scheduled). Taught in English. Topical analysis of cultural history of Brazil in context of Portuguese-speaking world, with emphasis on comparative, trans-Atlantic relations, social development, and artistic manifestations. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 596",
        "title": "Directed Individual Study or Research",
        "units": 4,
        "description": "Tutorial, to be arranged. Study or research in areas or subjects not offered as regular courses. The number of units that can be applied toward MA requirements varies by area/track of study within the department. Consult the department for details. S/U or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 597",
        "title": "Preparation for Graduate Examinations",
        "units": 4,
        "description": "Tutorial, to be arranged. Preparation: official acceptance of candidacy by department. Individual preparation for MA comprehensive examination or PhD qualifying examinations. May be taken only once for each degree examination and only in term that comprehensive or qualifying examinations are to be taken. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 598",
        "title": "Research for MA Thesis",
        "units": 4,
        "description": "Tutorial, to be arranged. Research in preparation of MA thesis. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 599",
        "title": "Research for PhD Dissertation",
        "units": 4,
        "description": "Tutorial, to be arranged. Limited to students who have passed PhD qualifying examinations. Research for and preparation of PhD dissertation. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 89",
        "title": "Honors Seminars",
        "units": 1,
        "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 89HC",
        "title": "Honors Contracts",
        "units": 1,
        "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 8A",
        "title": "Portuguese Conversation",
        "units": 2,
        "description": "Lecture, three hours. Requisite: course 1, 11A, Portuguese Language Assessment Interview, or enrollment in any Portuguese course. Designed to help beginner and intermediate students of Portuguese language improve their conversation skills through discussions, presentations, participation in events, and other communicative situations. Among other elements of speech, use of formal and informal speaking styles. Use of appropriate vocabulary to discuss issues relevant to students' lives and to Afro-Luso-Brazilian culture. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 1"},{"type": "requisite","course": "PORTGSE 11A"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 8B",
        "title": "Portuguese Conversation",
        "units": 2,
        "description": "Discussion, three hours. Enforced requisite: course 3 with grade of B or better. P/NP or letter grading.",
        "requisites": [
            {"type": "requisite","course": "PORTGSE 3"}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE 99",
        "title": "Student Research Program",
        "units": 1,
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE M122",
        "title": "Foundations in Visual Culture in Iberian, Latin American, and Luso-Brazilian Worlds",
        "units": 4,
        "description": "(Same as Spanish M122.) Lecture, four hours. Requisite: course 25 or 26 or 27 or Spanish 25 or 27. Taught in English. Addresses specificities of visual culture in Spanish- and Portuguese-speaking worlds. Through critical engagement with wide range of visual materials-from 16th-century maps of Americas to YouTube videos of street protects in Chile; from Modernist architectural designs for new national capitals to telenovelas and colonial photographs; and everything in between-introduction to practices, processes, objects of study, and interdisciplinary critical frameworks of field of visual culture studies. By examining manifestations of visual culture from Iberian, Latin American, and Luso-Brazilian contexts, students gain culturally specific foundations of visual knowledge and skills of visual literacy. P/NP or letter grading.",
        "requisites": [
            {"type": "group","needs": 1,"options": [{"type": "requisite","course": "PORTGSE 25"},{"type": "requisite","course": "PORTGSE 26"},{"type": "requisite","course": "PORTGSE 27"},{"type": "requisite","course": "SPAN 25"},{"type": "requisite","course": "SPAN 27"}]}
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE M142C",
        "title": "Travel Narratives, Testimony, Autobiography",
        "units": 4,
        "description": "(Formerly numbered 142C.) (Same as Comparative Literature M142.) Lecture, four hours. Taught in English. Exploration of travel, memory, and narrative in Portuguese-speaking world. Primary and secondary texts depict issues of displacement, cultural contact, and assimilation. Overview of connections among Portuguese-speaking cultures. May be repeated for credit with topic change. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE M200",
        "title": "Research Resources",
        "units": 4,
        "description": "(Same as Spanish M200.) Lecture, three hours. Identification and use of research resources for graduate students.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE M201A",
        "title": "Literary Theory and Criticism",
        "units": 4,
        "description": "(Same as Spanish M201A.) Lecture, three hours. Definition, discussion, and application of main currents of contemporary literary theory and criticism. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE M201B",
        "title": "Literary Theory and Criticism",
        "units": 4,
        "description": "(Same as Spanish M201B.) Lecture, three hours. Definition, discussion, and application of main currents of contemporary literary theory and criticism. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE M205A",
        "title": "Development of Portuguese and Spanish Languages",
        "units": 4,
        "description": "(Same as Spanish M205A.) Lecture, three hours. Intensive study of historical development of Portuguese and Spanish languages from their origin in spoken Latin.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE M205B",
        "title": "Development of Portuguese and Spanish Languages",
        "units": 4,
        "description": "(Same as Spanish M205B.) Lecture, three hours. Intensive study of historical development of Portuguese and Spanish languages from their origin in spoken Latin.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE M251A",
        "title": "Studies in Galegan-Portuguese and Old Spanish",
        "units": 4,
        "description": "(Same as Spanish M251A.) Lecture, two hours. Study of problems related to historical development of Galegan-Portuguese and Old Spanish. May be repeated once with topic change and consent of appropriate guidance committee.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE M251B",
        "title": "Studies in Galegan-Portuguese and Old Spanish",
        "units": 4,
        "description": "(Same as Spanish M251B.) Lecture, two hours. Study of problems related to historical development of Galegan-Portuguese and Old Spanish. May be repeated once with topic change and consent of appropriate guidance committee.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE M296T",
        "title": "Translation Research Group",
        "units": 2,
        "description": "(Same as English M296T and Spanish M296T.) Research group meeting, two hours. Limited to graduate students. Designed to bring together graduate students in seminar setting with one or more faculty members to discuss and translate Hispanic literary works from Spanish or Portuguese to English. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE M297A",
        "title": "Proseminar I",
        "units": 2,
        "description": "(Same as Spanish M297A.) Proseminar, two hours. Limited to graduate students. Introduction to doctoral study and to professions. Designed to bring together first-year graduate students in seminar setting to discuss how to define their own work in relation to literary, linguistic, and/or cultural studies, broader humanities field, and our various communities. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE M297B",
        "title": "Proseminar II",
        "units": 2,
        "description": "(Same as Spanish M297B.) Proseminar, two hours. Limited to graduate students. Designed to bring together third-year graduate students in seminar setting to discuss transition to independent research, conception of dissertation, presentation of research findings (publications and conferences), and preparation for job market. S/U grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "PORTGSE M35",
        "title": "Spanish, Portuguese, and Nature of Language",
        "units": 5,
        "description": "(Same as Spanish M35.) Lecture, three hours; discussion, one hour. Introduction to language study within context of Romance languages, focusing on Spanish and Portuguese. Nature of language: structure, diversity, evolution, social and cultural settings, literary uses. Study of language and its relation to other areas of human knowledge. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    }
]
