[
    {
        "id": "RES PRC 102",
        "title": "Research Practice: Research Revealed",
        "units": 2,
        "description": "(Formerly numbered 191A.) Seminar, two hours. Limited to students participating in Research Revealed undergraduate research preparation program. Students are prepared to conduct their own research, apply to research programs, or assist faculty members. Topics vary by term. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 103",
        "title": "Research Practice: Student Research Forum",
        "units": 2,
        "description": "Lecture/activities, four hours. Designed to promote deep engagement in university research, including instruction on securing research opportunities, skills necessary for research and professional success, exploring research internships on and off campus, and communication of research across all disciplines. May be repeated with consent of instructor. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 105",
        "title": "Effective Science Communication",
        "units": 2,
        "description": "Seminar, two hours. Effectively communication science in essential for careers in science, technology, engineering, and mathematics. Designed to strengthen and practice skills of sharing science. Emphasis on verbal communication and presentations, drawing on storytelling techniques to craft more compelling talks. Students have many hands-on experiences with presenting their research in different formats, for different audiences, and with different objectives. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 106",
        "title": "Scientific Leadership and Ethics",
        "units": 1,
        "description": "Seminar, two hours. Limited to undergraduates in UC LEADS or Clare Boothe Luce Scholars Programs. Individuals involved in science, technology, engineering, and mathematics (STEM) research are promoted throughout their careers due to their technical and scientific acumen. Many researchers attain leadership positions including running their laboratories, heading engineering departments, or working on research projects in which they are responsible for guiding students. The widely held system of training and promotion in the STEM fields does not provide researchers with skills the vast majority of employers feel are necessary for success in leadership endeavors. Researchers that do not find themselves in a managerial position need these social and organizational skills while working for principal investigators and research leaders. Provides instruction on these essential skills for STEM researchers through role-play, reflective journaling, problem-solving, and case studies. These principles are paired with lessons on ethics in the laboratory, focusing on real-world examples that may be faced by scientists and leaders. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 110A",
        "title": "Careers in Libraries and Archives",
        "units": 2,
        "description": "(Formerly numbered Honors Collegium 101M.) Seminar, two hours. Study of wide variety of careers in libraries and archives. Introduction to career pathways of various professionals. Brief discussion of professional issues in these fields especially in relation to recruitment and retention of individuals in these professions. Discussion of careers in variety of locations and types of libraries and archives, with emphasis on outstanding professionals at UCLA. Stronger focus on careers in academic spaces. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 110B",
        "title": "Preparing for Post-UCLA Success: Fellowships, Graduate School, and More",
        "units": 2,
        "description": "(Formerly numbered Honors Collegium 101K.) Seminar, two hours. Prepares students to achieve goals beyond UCLA. Participants reflect on values and interests, and learn what is required for effective applications to graduate school, scholarships, and more. Review of process of applying for nationally competitive awards such as Truman, Rhodes, Marshall, and others. Students learn to craft effective curricula vitae, strong personal statements, and compelling research proposals. Students learn to solicit strong letters of recommendation. Skills are preparation for scholarship/fellowship application process, as well as graduate school and job application process. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 120",
        "title": "Research Today: Sources, Tools, and Strategies",
        "units": 2,
        "description": "Seminar, two hours. Research is process of exploration, experimentation, and discovery. Study is designed to help students engage with this process and prepare for research-intensive honors thesis. Students collaborate with peers, mentors, and experts across the UCLA library as they develop their own approach to research. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 130",
        "title": "Integrity in Science Research",
        "units": 2,
        "description": "Seminar, two hours. Limited to students in funded research programs, or completing individual study senior thesis. Exploration of research integrity and discussion of important ethical issues that impact scientific investigation. Presentation of major issues in field of research ethics and integrity. Students work together in small groups to present and lead discussions on ethical dilemmas. Focus on research integrity issues that impact broad group of undergraduate researchers on UCLA campus. Student presentations are topical in nature, and vary from year to year based on recent ethical events. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 182",
        "title": "Developing Your Research Skills: Reading, Writing, and Sharing Academic Research in Humanities and Social Sciences",
        "units": 4,
        "description": "Seminar, three hours; workshop, three hours. Designed for visiting juniors and seniors in Mellon Mays Undergraduate Fellowship program who are engaged in multi-year research projects in humanities and social sciences at home institutions. Focus on development of three important research skills: reading scholarly writing, writing for scholarly audiences, and presenting research for academic and general audiences. Students are supported in producing seven to eight pages of polished writing in form of literature review, thesis chapter, or another meaningful unit of writing as agreed upon with instructor. Students learn to write abstract and present work orally and visually. Approaches reading, writing, and sharing academic research as ongoing, iterative processes. Students gain necessary tools to succeed in all parts of research process. Concludes with symposium in which work is presented. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 19",
        "title": "Fiat Lux Freshman Seminars",
        "units": 1,
        "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 192A",
        "title": "UCLA Undergraduate Science Journal",
        "units": 2,
        "description": "Seminar, two hours. Designed to guide students through critical aspects of preparing UCLA Undergraduate Science Journal for publication. These aspects of writing, reviewing, editing, and formatting articles for publication are essential to research process for sharing findings and engaging with broader scientific and engineering community. Students develop teamwork and project management skills that can help in future career paths. May be repeated for maximum of 10 units. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 192B",
        "title": "Aleph: UCLA Undergraduate Research Journal for Humanities and Social Sciences",
        "units": 2,
        "description": "(Formerly numbered Honors Collegium 101C.) Seminar, two hours. Limited to students on editorial board of Aleph journal. Students participate in workshops to assess, edit, and publish journal articles. May be repeated for maximum of 10 units. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 193",
        "title": "Variable Topics: Research Practice Journal Club",
        "units": 2,
        "description": "(Formerly numbered Neurobiology M171 and Physiological Science M171.) Seminar, two hours. Limited by application. Centered on presentation and critical analysis of scientific journal articles, and presentation of students' own research. Intensive literature-based training program which increases student confidence and scientific literacy, and facilitates transition to postgraduate study. May be repeated for maximum of 10 units. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 194A",
        "title": "Mellon Mays Undergraduate Fellows Research Seminar",
        "units": 2,
        "description": "(Formerly numbered Honors Collegium 101J.) Seminar, two hours. Limited to current Mellon Mays undergraduate fellows. Designed to support students in their research, and in preparation for graduate school and professional careers. May be repeated five times for credit. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 194B",
        "title": "Research Seminar: Writing Research Proposals and Graduate Applications",
        "units": 2,
        "description": "Seminar, two hours. Research seminar for undergraduates applying in fall for science, technology, engineering, and mathematics (STEM) PhD or MS programs. Designed to support students in their research, and in preparation for graduate school and professional careers. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 194C",
        "title": "Mastering Oral Presentation of Your Research",
        "units": 2,
        "description": "Seminar, two hours. Examination of best practices in oral presentation of scientific research. Familiarization with rubric used to evaluate oral research presentations given by graduate students and peers. Students present their research, tailored to diverse audience of science-savvy students, and give feedback to their peers. Oral and written feedback is used to help students revise their talks. Culminates with second research presentation by each student. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 195",
        "title": "Research Activities",
        "units": 4,
        "description": "Tutorial, 12 hours. Designed to provide academic context for off-campus, remote work at research institutions outside of UCLA. Students work independently with graduate student mentor to learn about research teams, discuss management of research protocols and data, and work weekly on science writing, culminating in production of research abstract and assembly of research paper. May be repeated for credit up to two consecutive quarters. Individual contract required. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 199",
        "title": "Directed Practice of Research",
        "units": 4,
        "description": "Tutorial, 12 hours. Limited to juniors/seniors. Supervised individual research at an off-site location under guidance of UCLA faculty mentor. Culminating report/thesis required. May be repeated for maximum of 32 units. Individual contract required. Letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 96",
        "title": "Bruins Studying Bruins: Introduction to Higher Education Research through Course-Based Collaborative Research Project",
        "units": 2,
        "description": "Seminar, two hours. Introduction to higher education research methods in archival and media studies through course-based research experience. Collaborative project exploring UCLA campus history, student experience, and cutting-edge innovations across disciplines. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 97XA",
        "title": "PEERS Freshman Seminar: Succeeding in Science",
        "units": 1,
        "description": "(Formerly numbered Ecology and Evolutionary Biology 97XA.) Seminar, one hour. Limited to students in Program for Excellence in Education and Research in Sciences (PEERS). Series of lectures, workshops, and discussions to enhance student success in sciences by developing critical academic survival skills, acquainting students with practice of science, and highlighting opportunities available to participate in research as undergraduate students. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 97XB",
        "title": "PEERS Sophomore Seminar: Pathways in Majors, Careers, and Entry into Research",
        "units": 1,
        "description": "(Formerly numbered Ecology and Evolutionary Biology 97XB.) Seminar, one hour. Limited to students in Program for Excellence in Education and Research in Sciences (PEERS). Series of lectures and workshops to enhance student success in sciences by acquainting students with practice of science, opportunities available to participate in research as undergraduate students, and careers available to students with science degrees. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 97XC",
        "title": "Transfer Success and Pathways to Undergraduate Research for Life Sciences Majors",
        "units": 4,
        "description": "Seminar, one hour. Limited to new transfer students. Designed to provide essential academic skills for life science transfer students, and promote engagement in university research including instruction on securing research opportunities and skills necessary for research and professional success, communication of research, and exploring funding resources and life science careers. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 97XD",
        "title": "Research Unwrapped: Introduction to Research in Sciences",
        "units": 1,
        "description": "Seminar, two hours. Exposes students to university research and wide array of research practices in sciences. Introduction to benefits of undergraduate research, scientific method, information and publication search strategies, science communication, and degree and careers requiring research experience. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 98T",
        "title": "Discipline-Based Research Practices",
        "units": 4,
        "description": "Seminar, three hours. Introduction to discipline-based inquiry methods through individual or team research/creative projects. Students gain knowledge of practices such as research design, methodologies, analysis, and/or ethics used in a discipline. Consult Schedule of Classes for topics and instructors. P/NP or letter grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    },
    {
        "id": "RES PRC 99",
        "title": "Student Research Program",
        "units": 1,
        "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
        "requisites": [
        ],
        "equivalentCourses": []
    }
]
